[{"id":"frag_000a354b","text_content":"Background: Sodium-Glucose Cotransporter-2 inhibitors (SGLT2i), Dipeptyl Peptidase-4 inhibitors (DPP-4i) and Glucagon-Like Peptide-1 agonists (GLP-1a) effectively reduce HbA1c levels. Their long-term cardiovascular effects have been tested against placebo, but the comparative efficacy of individual drug types is unclear. Aim: To compare the efficacy of SGLT2i, DPP-4i and GLP-1a for reducing cardiovascular outcomes by network meta-analysis. Methods: Medline, Embase and the Cochrane Library Central Register of Controlled Trials were searched for randomised controlled trials (RCTs) of >12 weeks’ duration enrolling patients with type 2 diabetes and comparing drugs of SGLT2i, DPP-4i or GLP-1a classes with another included class or control. Comparative point estimates were synthesised by random effects frequentist network meta-analysis. Results: In all, 236 RCTs were included, accounting for 176,310 patients across 20 interventions (DPP-4i: 6; GLP-1a: 7; SGLT2i: 7). Empagliflozin and liraglutide reduced cardiovascular mortality compared to control (RR 0.63; 95% CI 0.51-0.79; P Conclusions: Empagliflozin and liraglutide demonstrate the greatest efficacy for cardiovascular mortality, while SGLT2i may exert additional benefits in heart failure. This study provides evidence to support clinical decisions in treatment of type 2 diabetes. Disclosure A.J. Roddick: None. S. Zheng: None.","heading_context":"Abstract","domain":"doi.org","title":"Comparative Cardiovascular Efficacy of SGLT2 Inhibitors, DPP-4 Inhibitors, and GLP-1 Agonists—A Network Meta-analysis","url":"https://doi.org/10.2337/DB18-427-P"},
{"id":"frag_018f8104","text_content":"Trial Evaluating Cardiovascular Outcomes with Sitagliptin (TECOS) assessed the cardiovascular (CV) safety of sitagliptin versus placebo on CV outcomes in patients with type 2 diabetes and CV disease and found sitagliptin noninferior to placebo. Subsequently, based on feedback from FDA, the Sponsor of the trial, Merck & Co., Inc., engaged a separate academic research organization, the TIMI Study Group, to re‐adjudicate a prespecified set of originally adjudicated events.","heading_context":"Abstract","domain":"www.ncbi.nlm.nih.gov","title":"Re‐adjudication of the Trial Evaluating Cardiovascular Outcomes with Sitagliptin (TECOS) with study‐level meta‐analysis of hospitalization for heart failure from cardiovascular outcomes trials with dipeptidyl peptidase‐4 (DPP‐4) inhibitors","url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9286326"},
{"id":"frag_0488b542","text_content":"Introduction and Objective: This study assesses the risk of severe hepatic disease (SHD: cirrhosis, hepatocellular carcinoma, or spontaneous bacterial peritonitis) in type 2 diabetes patients (T2DM) with metabolic dysfunction-associated steatotic liver disease (MASLD) treated with GLP-1RAs versus DPP-4i or SGLT2i.\n Methods: A retrospective cohort study was performed using MarketScan databases (2017-2021). Eligible T2DM+MASLD patients met 1-year baseline enrollment with no antidiabetic agents other than biguanides/sulfonylureas. Patients having prior SHD, liver transplantation, bariatric surgery, alcohol/drug use, or other liver diseases were excluded. GLP-1RA patients were matched with DPP-4i and SGLT2i patients based on age, sex, treatment year and propensity scores from clinical characteristics. Time-to SHD up to 2-years was compared using Cox proportional hazard regression model where patients were censored with SHD event, disenrollment, or study end.\n Results: Analysis included 2,656 pairs of patients for the DPP-4 vs. GLP-1RA and 4,311 pairs for the GLP-1RA vs. SGLT2i analyses. GLP-1RA exhibited lower risk than DPP-4i at 1 year (HR 0.34) and 2 years (HR 0.29; both p<0.001). Compared to SGLT2i, GLP-1 RA patients showed higher risk of SHD at 2 years (HR 1.70, p<0.001).\n Conclusion: The increased risk of SHD with SGLT2i compared to GLP-1 RA needs further investigation.\n \n \n \n J. Sarker: Employee; Merck Sharp & Dohme Corp. E.M. Okpara: None. B. De Los Santos: Employee; Takeda Pharmaceutical Company. M.T. Kim: Other Relationship; Takeda Pharmaceutical Company. K. Kim: Consultant; Renalytix. Other Relationship; Takeda Pharmaceutical Company.\n","heading_context":"Abstract","domain":"doi.org","title":"859-P: GLP-1 Receptor Agonists vs. DPP-4 Inhibitors and SGLT2 Inhibitors on Liver Outcomes in Metabolic Dysfunction–Associated Steatotic Liver Disease","url":"https://doi.org/10.2337/db25-859-p"},
{"id":"frag_075e1e0e","text_content":"Alogliptin was initially approved to treat T2DM in Japan in 2010 and then approved by FDA and by EMA in 2013. Alogliptin, a highly potent and selective, noncovalent inhibitor of DPP-4. Inhibition of DPP-4 activity, alogliptin slows the inactivation of incretin hormones, glucagon-like peptide-1 (GLP-1). In terms of drug safety alogliptin is generally well-tolerated, with a low risk of hypoglycemia, weight gain, acute pancreatitis, and hepatotoxicity. Alogliptin has been effectively combined with Metformin or Pioglitazone to provide better glycaemic control. The drug can be used in mild hepatic or renal impairment with appropriate dosage adjustment. Treatment with alogliptin has shown less weight gain compared with sulfonylureas. Alogliptin and FDC of Alogliptin + Metformin approved and available in India with brand name Aloja & Aloja M/Forte, with well documented safety and efficacy through phase IV study conducted in India.","heading_context":"Abstract","domain":"www.ijpca.org","title":"Steps in discovery of alogliptin","url":"https://www.ijpca.org/journal-article-file/22345"},
{"id":"frag_093f16d9","text_content":"International audience","heading_context":"Abstract","domain":"academic.oup.com","title":"2019 ESC Guidelines on diabetes, pre-diabetes, and cardiovascular diseases developed in collaboration with the EASD","url":"https://academic.oup.com/eurheartj/article-pdf/41/2/255/33115788/ehz486.pdf"},
{"id":"frag_09594923","text_content":"The increasing prevalence of both type 2 diabetes mellitus and heart failure has underscored the urgent need for optimized therapeutic strategies that address the complex interplay between these conditions. Dipeptidyl peptidase-4 (DPP-4) inhibitors have emerged as a popular class of glucose-lowering agents due to their favorable glycemic effects, safety profile, and potential cardiovascular benefits. However, the impact of DPP-4 inhibitors on heart failure outcomes in patients with diabetes remains contentious, with conflicting evidence from clinical trials and observational studies. This review critically examines current evidence on the use of DPP-4 inhibitors in patients with coexisting diabetes and heart failure, focusing on pharmacodynamics, safety, and efficacy outcomes. We explore the physiological mechanisms by which DPP-4 inhibitors may influence heart failure risk, including modulation of inflammation, oxidative stress, and myocardial fibrosis. Clinical trials such as SAVOR-TIMI 53, EXAMINE, and TECOS are evaluated to provide a comprehensive analysis of DPP-4 inhibitors’ effects on hospitalization for heart failure, mortality, and cardiovascular events in diabetic patients. While some trials suggest an increased risk of HF hospitalizations with specific DPP-4 inhibitors (e.g., saxagliptin), others report neutral effects, raising questions about the class effects versus individual drug characteristics within this group. Additionally, we address discrepancies in outcomes related to patient demographics, HF phenotype, and comorbid conditions that may influence DPP-4 inhibitors’ risk–benefit profile. Comparative insights into alternative glucose-lowering therapies such as SGLT2 inhibitors and GLP-1 receptor agonists are also provided, highlighting potential implications for treatment selection in this high-risk population. In summary, this review synthesizes available evidence on DPP-4 inhibitors’ impact in diabetic patients with heart failure, aiming to guide clinicians in making informed therapeutic decisions. While DPP-4 inhibitors remain a viable option in diabetes management, caution is warranted in patients with advanced heart failure, and future research is essential to refine patient-specific guidelines.","heading_context":"Abstract","domain":"doi.org","title":"Impact of DPP-4 Inhibitors in Patients with Diabetes Mellitus and Heart Failure: An In-Depth Review","url":"https://doi.org/10.3390/medicina60121986"},
{"id":"frag_0dac6bbc","text_content":"IntroductionFor people with type 2 diabetes (T2DM) inadequately controlled with oral antidiabetic drugs (OADs), evidence from both randomized controlled trials (RCTs) and real-world studies has demonstrated that treatment intensification with liraglutide offers effective glycemic control, weight reduction, and a lower risk of hypoglycemia compared to treatment intensification with insulin or additional OADs. Sodium glucose cotransporter 2 (SGLT-2) inhibitors are a new class of OADs that have also been shown to be effective in T2DM patients inadequately controlled with OADs. Currently there are no head-to-head RCTs comparing these to liraglutide.MethodsWe aimed to evaluate the relative efficacy, using network meta-analysis (NMA), of treatment intensification with liraglutide and SGLT-2 inhibitors people with T2DM who have been treated with metformin (alone or in combination with SU, DPP-4, and TZD). We performed a systematic literature review to identify relevant RCTs comparing liraglutide (1.2 and 1.8 mg), canagliflozin (100 and 300 mg), empagliflozin (10 and 25 mg), or dapagliflozin (5 and 10 mg) to placebo. To strengthen the indirect evidence base, we also included non-placebo RCTs where sitagliptin (100 mg) was the active comparator. Bayesian NMA was performed on the following outcomes to assess the relative efficacy and safety of interventions: reduction (change) in HbA1c, weight, and fasting plasma glucose (FPG) as well as proportion reaching target HbA1c (<7%), and risk of hypoglycemia. Doses for each intervention were considered separately.ResultsA total of 16 RCTs were identified. All trials were similar with respect to important baseline characteristics and study design. Both doses of liraglutide were generally statistically significantly superior to the SGLT-2s with respect to change from baseline in HbA1c and FPG as well as odds of reaching target HbA1c <7%. For weight, canagliflozin 300 mg was superior to liraglutide 1.2 mg, and SGLT-2s were generally associated with larger change from baseline in weight. For risk of major or minor hypoglycemia, no differences were found between treatments.ConclusionsCompared to SGLT-2 inhibitors, liraglutide offers improvement in HbA1c and FPG. Reductions in weight are likely comparable between liraglutide and SGLT-2s. Liraglutide did not differ from SGLT-2s in terms of risk of hypoglycemia. Given the lack of head-to-head evidence, this analysis provides valuable insight into the comparative outcomes of liraglutide versus SGLT-2 inhibitors.","heading_context":"Abstract","domain":"link.springer.com","title":"Liraglutide Versus SGLT-2 Inhibitors in People with Type 2 Diabetes: A Network Meta-Analysis","url":"https://link.springer.com/content/pdf/10.1007%2Fs13300-016-0217-4.pdf"},
{"id":"frag_1272a608","text_content":"Objective Sodium-glucose co-transporter 2 inhibitors (SGLT2-i) are a novel drug class for the treatment of diabetes. We aimed at describing the maximal benefits and risks associated with SGLT2-i for patients with type 2 diabetes. Design Systematic review and meta-analysis. Data Sources and Study Selection We included double-blinded, randomised controlled trials (RCTs) evaluating SGLT2-i administered in the highest approved therapeutic doses (canagliflozin 300 mg/day, dapagliflozin 10 mg/day, and empagliflozin 25 mg/day) for ≥12 weeks. Comparison groups could receive placebo or oral antidiabetic drugs (OAD) including metformin, sulphonylureas (SU), or dipeptidyl peptidase 4 inhibitors (DPP-4-i). Trials were identified through electronic databases and extensive manual searches. Primary outcomes were glycated haemoglobin A1c (HbA1c) levels, serious adverse events, death, severe hypoglycaemia, ketoacidosis and CVD. Secondary outcomes were fasting plasma glucose, body weight, blood pressure, heart rate, lipids, liver function tests, creatinine and adverse events including infections. The quality of the evidence was assessed using GRADE. Results Meta-analysis of 34 RCTs with 9,154 patients showed that SGLT2-i reduced HbA1c compared with placebo (mean difference -0.69%, 95% confidence interval -0.75 to -0.62%). We downgraded the evidence to ‘low quality’ due to variability and evidence of publication bias (P = 0.015). Canagliflozin was associated with the largest reduction in HbA1c (-0.85%, -0.99% to -0.71%). There were no differences between SGLT2-i and placebo for serious adverse events. SGLT2-i increased the risk of urinary and genital tract infections and increased serum creatinine, and exerted beneficial effects on bodyweight, blood pressure, lipids and alanine aminotransferase (moderate to low quality evidence). Analysis of 12 RCTs found a beneficial effect of SGLT2-i on HbA1c compared with OAD (-0.20%, -0.28 to -0.13%; moderate quality evidence). Conclusion This review includes a large number of patients with type 2 diabetes and found that SGLT2-i reduces HbA1c with a notable increased risk in non-serious adverse events. The analyses may overestimate the intervention benefit due bias.","heading_context":"Abstract","domain":"journals.plos.org","title":"Benefits and Harms of Sodium-Glucose Co-Transporter 2 Inhibitors in Patients with Type 2 Diabetes: A Systematic Review and Meta-Analysis","url":"https://journals.plos.org/plosone/article/file?id=10.1371/journal.pone.0166125&type=printable"},
{"id":"frag_12d14dd6","text_content":"Objectives To develop a longitudinal statistical model to indirectly estimate the comparative efficacies of two drugs, using model-based meta-analysis (MBMA). Comparison of two oral dipeptidyl peptidase (DPP)-4 inhibitors, sitagliptin and linagliptin, for type 2 diabetes mellitus (T2DM) treatment was used as an example. Design Systematic review with MBMA. Data sources MEDLINE, EMBASE, http://www.ClinicalTrials.gov, Cochrane review of DPP-4 inhibitors for T2DM, sitagliptin trials on Food and Drug Administration website to December 2011 and linagliptin data from the manufacturer. Eligibility criteria for selecting studies Double-blind, randomised controlled clinical trials, ≥12 weeks’ duration, that analysed sitagliptin or linagliptin efficacies as changes in glycated haemoglobin (HbA1c) levels, in adults with T2DM and HbA1c >7%, irrespective of background medication. Model development and application A Bayesian model was fitted (Markov Chain Monte Carlo method). The final model described HbA1c levels as function of time, dose, baseline HbA1c, washout status/duration and ethnicity. Other covariates showed no major impact on model parameters and were not included. For the indirect comparison, a population of 1000 patients was simulated from the model with a racial composition reflecting the average racial distribution of the linagliptin trials, and baseline HbA1c of 8%. Results The model was developed using longitudinal data from 11 234 patients (10 linagliptin, 15 sitagliptin trials), and assessed by internal evaluation techniques, demonstrating that the model adequately described the observations. Simulations showed both linagliptin 5 mg and sitagliptin 100 mg reduced HbA1c by 0.81% (placebo-adjusted) at week 24. Credible intervals for participants without washout were −0.88 to −0.75 (linagliptin) and −0.89 to −0.73 (sitagliptin), and for those with washout, −0.91 to −0.76 (linagliptin) and −0.91 to −0.75 (sitagliptin). Conclusions This study demonstrates the use of longitudinal MBMA in the field of diabetes treatment. Based on an example evaluating HbA1c reduction with linagliptin versus sitagliptin, the model used seems a valid approach for indirect drug comparisons.","heading_context":"Abstract","domain":"bmjopen.bmj.com","title":"A novel model-based meta-analysis to indirectly estimate the comparative efficacy of two medications: an example using DPP-4 inhibitors, sitagliptin and linagliptin, in treatment of type 2 diabetes mellitus","url":"https://bmjopen.bmj.com/content/bmjopen/3/3/e001844.full.pdf"},
{"id":"frag_1332536f","text_content":"Simple Summary We present a systematic overview of EMA-approved oncologic drugs, both as new or extensions of indications, over 6 years, from 2015 to 2020. Our analysis confirms a long-standing trend in drug development for which most of the efforts led to broadening indications of pre-existing molecules, with immunotherapy and signal transduction inhibitors contending the leadership. Many drugs with the same or a very similar mechanism of action are approved for the same indication without a direct head-to-head comparison. Moreover, we show that the majority of drugs entered the market without evidence of overall survival or quality of life benefit but based on surrogate outcomes. Our data support some considerations about the modern drug development in oncology, where the goal is to provide the patients with the fastest possible access to new drugs. The debate on the optimal methodology to develop new drugs remains an unmet need. Abstract (1) Background: Drug development in oncology is changing rapidly. The aim of the present study was to provide an insight into the features of anti-tumor drugs approved in Europe; (2) Methods: We included all the indications for solid tumors issued by the European Medicines Agency (EMA) between 2015 and 2020. We extracted data from European Public Assessments Reports (EPAR), including drug name, mechanism of action, setting, features of pivotal clinical trials, primary end-points, quality of life (QoL); (3) Results: In the explored period, EMA issued 132 new indications (81 indications’ extensions) for 62 oncology drugs. In about half of indications (47%), the approval was biomarker-based. Immune check point inhibitors (ICIs) and signal transduction inhibitors were the two most representative drug categories (62%). Most of the indications were for the advanced setting (91%) and front-line therapy (66%). The most common tumor types were non-small cell lung cancer (24%), breast (16%), and melanoma (10%). Two thirds of the indications (73%) were approved based on phase III trials. Overall survival (OS) represented the primary end-point only in 39% of indications, mainly limited to advanced setting (98%) and ICI trials (80%). Almost all (94%) cell cycle and DNA repair mechanism inhibitors were approved based on progression free survival (PFS) data. In pivotal trials with signal transduction inhibitors, objective response rate (ORR) was the prevalent (45%) primary end-point. QoL was never considered as primary end-point; (4) Conclusions: In this analysis, we intended to offer an updated picture of the recent drug development in oncology. Most of the efforts led to broadening indications of pre-existing molecules, with signal transduction inhibitor and ICIs contending the leadership. Twenty-seven percent of the indication were approved without a phase III trial. The majority of drugs entered the market without evidence of OS or QoL benefit but based on surrogate outcomes.","heading_context":"Abstract","domain":"www.mdpi.com","title":"Oncologic Drugs Approval in Europe for Solid Tumors: Overview of the Last 6 Years","url":"https://www.mdpi.com/2072-6694/14/4/889/pdf?version=1644571355"},
{"id":"frag_151e4c9e","text_content":"Background. One hundred years have passed since the discovery of insulin, which is one of the most relevant events of the 20th century. This period resulted in extraordinary progress in the development of novel molecules to improve glucose control, simplify the insulin regimen, and ameliorate the quality of life. In late March 2024, the first once-weekly basal analog Icodec was approved for diabetes mellitus, generating high expectations. Our aim was to systematically review and meta-analyze the efficacy and safety of Icodec compared to once-daily insulin analogs in type 1 (T1D) and type 2 diabetes (T2D). Methods. PubMed/MEDLINE, Cochrane Library, and ClinicalTrials.gov were searched for randomized clinical trials (RCTs). Studies were included for the synthesis according to the following prespecified inclusion criteria: uncontrolled T1D or T2D, age ≥ 18 years, insulin Icodec vs. active comparators (Degludec U100, Glargine U100, Glargine U300, and Detemir), phase 3, multicenter, double-blind or open-label RCTs, and a study duration ≥ 24 weeks. Results. The systematic review included 4347 patients with T1D and T2D inadequately controlled (2172 randomized to Icodec vs. 2175 randomized to once-daily basal analogs). Icodec, compared to once-daily basal analogs, slightly reduced the levels of glycated hemoglobin (HbA1c) with an estimated treatment difference (ETD) of −0.14% [95%CI −0.25; −0.03], p = 0.01, and I2 68%. Patients randomized to Icodec compared to those on once-daily basal analogs had a greater probability to achieve HbA1c < 7% without clinically relevant or severe hypoglycemic events in 12 weeks from randomization with an estimated risk ratio (ERR) of 1.17, [95%CI 1.01, 1.36], p = 0.03, and I2 66%. We did not find a difference in fasting glucose levels, time in range, and time above range between Icodec and comparators. Icodec, compared to once-daily basal analogs, resulted in a slight but statistically significant weight gain of 0.62 kg [95%CI 0.25; 0.99], p = 0.001, and I2 25%. The frequency of hypoglycemic events (ERR 1.16 [95%CI 0.95; 1.41]), adverse events (ERR 1.04 [95%CI 1.00; 1.08]), injection-site reactions (ERR 1.08 [95%CI 0.62; 1.90]), and the discontinuation of treatments were similar between the two groups. Icodec was found to work better when used in a basal-only than basal-bolus regimen with an ETD in HbA1c of −0.22%, a probability of achieving glucose control of +33%, a probability of achieving glucose control without clinically relevant or severe hypoglycemia of +28%, more time spent in target (+4.55%) and less time spent in hyperglycemia (−5.14%). The risk of clinically relevant or severe hypoglycemic events was significantly higher when background glinides and sulfonylureas were added to basal analogs (ERR 1.42 [95%CI 1.05; 1.93]). Conclusion. Insulin Icodec is substantially non-inferior to once-daily insulin analogs in T2D, either insulin-naïve or insulin-treated. However, Icodec works slightly better than competitors when used in a basal-only rather than basal-bolus regimen. Weight gain and hypoglycemic risk are substantially low but not negligible. Patients’ education, adequate lifestyle and pharmacological interventions, and appropriate therapy adjustments are essential to minimize risks. This systematic review is registered as PROSPERO CRD42024568680.","heading_context":"Abstract","domain":"doi.org","title":"Once-Weekly Insulin Icodec in Diabetes Mellitus: A Systematic Review and Meta-Analysis of Randomized Clinical Trials (ONWARDS Clinical Program)","url":"https://doi.org/10.3390/biomedicines12081852"},
{"id":"frag_1a56b463","text_content":"A. Classification of diabetes B. Diagnosis of diabetes C. Categories of increased risk for diabetes (prediabetes) II","heading_context":"Abstract","domain":"diabetesjournals.org","title":"Standards of Medical Care in Diabetes—2011","url":"https://diabetesjournals.org/care/article-pdf/34/Supplement_1/S11/477902/zdc10111000s11.pdf"},
{"id":"frag_1acc67a1","text_content":"The prevalence of diabetes and its associated complications is increasing throughout the decades. Promising diabetes medications were introduced to the market including GLP-1 agonists, DPP-4 inhibitors, and SGLT2 inhibitors aiming to target these complications. The literature lacks sufficient data regarding these new medications and their influence on nephropathy, retinopathy, and neuropathy. This review expands on the major results of effects of the 3 drug classes on microvascular complications. In our review, both SGLT2 inhibitors and GLP-1 agonists appear to have promising nephroprotective outcomes at this stage, with less promising outcomes seen with DPP-4 inhibitors. Moreover, the retinoprotective outcomes of both SGLT2 inhibitors and DPP-4 inhibitors were only tested on mice, while those of GLP-1 agonists were assessed in few trials. In addition, the results of both GLP-1 agonists and DPP-4 inhibitors showed discrepancies in these studies. On the contrary, conclusions regarding the effect of these medications on neuroprotective outcomes cannot be drawn at the time due to the lack of clinical trials targeting these complications. Hence, a clearer picture of the microvascular outcomes will manifest over time with the release of multiple upcoming clinical trials.","heading_context":"Abstract","domain":"downloads.hindawi.com","title":"SGLT2 Inhibitors, GLP-1 Agonists, and DPP-4 Inhibitors in Diabetes and Microvascular Complications: A Review","url":"https://downloads.hindawi.com/journals/ije/2020/1762164.pdf"},
{"id":"frag_1e89ea1b","text_content":"Table 1dProperties of currently available glucose-lowering agents that may guide treatment choice in individual patients with type 2 diabetes mellitus Class Compound(s) Cellular mechanism","heading_context":"Abstract","domain":"care.diabetesjournals.org","title":"Management of Hyperglycemia in Type 2 Diabetes: A Patient-Centered Approach","url":"https://care.diabetesjournals.org/content/diacare/35/6/1364.full.pdf"},
{"id":"frag_2785f304","text_content":"IntroductionErtugliflozin is a new sodium-glucose co-transporter-2 inhibitor (SGLT2i) for the treatment of type 2 diabetes mellitus. As there are no head-to-head trials comparing the efficacy of SGLT2is, the primary objective of this analysis was to indirectly compare ertugliflozin to other SGLT2i in patient populations with inadequately controlled glycated hemoglobin (HbA1c > 7.0%) and previously treated with either diet/exercise, metformin alone or metformin plus a dipeptidyl peptidase-4 inhibitor (DPP4i).MethodsA systematic literature review (SLR) identified randomized controlled trials (RCTs) reporting outcomes at 24–26 weeks of treatment. Comparators to ertugliflozin were the SGLT2is canagliflozin, dapagliflozin and empagliflozin, with non-SGLT2i comparators also evaluated third-line [insulin and glucagon-like peptide-1 receptor agonists (GLP-1 RAs)]. Outcomes were change from baseline in HbA1c, weight and systolic blood pressure (SBP) as well as HbA1c < 7% and key safety events. Bayesian network meta-analysis was used to synthesize evidence. Results are presented as the median of the mean difference (MD) or as odds ratios with 95% credible intervals (CrI).ResultsIn patients uncontrolled on diet/exercise, the efficacy of ertugliflozin 5 mg monotherapy was not significantly different from that of other low-dose SGLT2is in terms of HbA1c reduction, while ertugliflozin 15 mg was more effective than dapagliflozin 10 mg (MD − 0.36%, CrI − 0.65, − 0.08) and empagliflozin 25 mg (MD − 0.31%, CrI − 0.58, − 0.04). As add-on therapy to metformin, ertugliflozin 5 mg was more effective in lowering HbA1c than dapagliflozin 5 mg (MD − 0.22%, CrI − 0.42, − 0.02), and ertugliflozin 15 mg was more effective than dapagliflozin 10 mg (MD − 0.26%, CrI − 0.46, − 0.06) and empagliflozin 25 mg (MD − 0.23%, CrI − 0.44, − 0.03). Among patients uncontrolled on combination therapy metformin plus a DPP4i, no relevant RCTs with insulin were identified from the SLR. One study with a GLP-1 RA was included in a sensitivity analysis due to limited data. There were no differences between ertugliflozin 5 or 15 mg and other SGLT2is, with the exception of dapagliflozin 10 mg, which was significantly less effective when added to sitagliptin and metformin. Overall, there were no other significant differences for remaining efficacy and safety outcomes except for a lower SBP for canagliflozin 300 mg compared to ertugliflozin 15 mg in the diet/exercise population.ConclusionsIndirect comparisons for HbA1c reduction found that ertugliflozin 5 mg was more effective than dapagliflozin 5 mg when added to metformin monotherapy, whereas ertugliflozin 15 mg was more effective than dapagliflozin 10 mg and empagliflozin 25 mg when added to diet/exercise and to metformin monotherapy. The HbA1c reduction associated with ertugliflozin was no different than that associated with canagliflozin across all populations.FundingMerck Sharp & Dohme Corp., a subsidiary of Merck & Co., Inc., Kenilworth, NJ, USA, and Pfizer Inc., New York, NY, USA.","heading_context":"Abstract","domain":"link.springer.com","title":"Ertugliflozin Compared to Other Anti-hyperglycemic Agents as Monotherapy and Add-on Therapy in Type 2 Diabetes: A Systematic Literature Review and Network Meta-Analysis","url":"https://link.springer.com/content/pdf/10.1007/s13300-019-0566-x.pdf"},
{"id":"frag_297b17ae","text_content":"This systematic review and meta-analysis aimed to compare the overall and site-specific cancer risk associated with SGLT2i versus DPP4i in patients with type 2 diabetes mellitus. We systematically searched PubMed, Scopus, and Web of Science for cohort studies comparing cancer incidence in adult type 2 diabetes patients treated with SGLT2i versus DPP4i. Risk ratios (RRs) with 95% confidence intervals (CIs) were pooled using a random-effects model due to significant heterogeneity (I²). Subgroup analyses by cancer type and publication bias assessment were performed. Seventeen cohort studies met the inclusion criteria. Overall, SGLT2i use was associated with a significantly lower risk of incident cancer compared to DPP4i use (Pooled RR = 0.77, 95%CI:0.70–0.84; I²=81.6%). Subgroup analyses revealed significantly lower risks for liver (RR = 0.76), lung (RR = 0.87), and prostate (RR = 0.75) cancers with SGLT2i. Trends towards lower risk were observed for colorectal (RR = 0.80) and stomach (RR = 0.69) cancers. No significant differences were found for bladder, breast, or pancreatic cancer risk. This meta-analysis suggests that SGLT2 inhibitors are associated with a reduced overall risk of cancer compared to DPP-4 inhibitors in patients with type 2 diabetes mellitus, particularly for liver, lung, and prostate cancers. However, these findings are based on observational data with significant heterogeneity and varying follow-up times, requiring additional long-term research to confirm.","heading_context":"Abstract","domain":"doi.org","title":"Comparative risk of cancer associated with SGLT inhibitors and DPP-4 inhibitors in patients with diabetes: a systematic review and meta-analysis","url":"https://doi.org/10.1186/s13098-025-01898-z"},
{"id":"frag_33e2e2b6","text_content":"\n Type 2 diabetes mellitus (T2DM) significantly increases the risk of cardiovascular diseases. Despite advances in glycemic control, managing cardiovascular risk remains a critical challenge. This systematic review aims to assess and compare the cardiovascular outcomes associated with three classes of antidiabetic medications: sulfonylureas, Glucagon-like peptide-1 receptor agonists (GLP-1 RAs), and dipeptidyl peptidase-4 inhibitors (DPP-4i) in patients with T2DM. A systematic review was conducted following the Preferred Reporting Items for Systematic reviews and Meta-Analyses (PRISMA) guidelines. Electronic databases, including PubMed, Embase, Cochrane Library, and Google Scholar, were searched for relevant studies published between 2019 and 2023. Inclusion criteria were adults (≥18 years) with T2DM, studies assessing cardiovascular outcomes with the specified medications, randomized controlled trials, observational studies, or meta-analyses. Two independent reviewers performed data extraction and risk of bias assessments. From the initial 1,543 records, 12 studies were included involving 61,534 patients. As a result, GLP-1 RAs demonstrated favorable cardiovascular safety and efficacy, particularly in reducing major adverse cardiovascular events and all-cause mortality. DPP-4 inhibitors were associated with neutral cardiovascular outcomes but indicated an elevated risk of cardiac failure in some studies. In recent studies, sulfonylureas, previously associated with cardiovascular concerns, showed no consistent evidence of increased cardiovascular risk. These findings highlight the importance of personalized treatment strategies to optimize cardiovascular outcomes in patients with T2DM.","heading_context":"Abstract","domain":"doi.org","title":"Systematic Review of Cardiovascular Outcomes with Sulfonylureas, GLP-1 RA, and DPP-4 Inhibitors in Type 2 Diabetes Mellitus","url":"https://doi.org/10.4103/jod.jod_80_24"},
{"id":"frag_34b4784a","text_content":"This study assessed the effects of dipeptidyl peptidase‐4 inhibitors (DPP4is) vs. sulfonylureas (SUs) on composite renal, cardiovascular, and hospitalized hypoglycemia outcomes in type 2 diabetes (T2D) patients with advanced chronic kidney disease (CKD) who were underrepresented in previous clinical studies. The National Health Insurance Research Database was utilized. Patients with T2D and advanced CKD (stages 3b‐5) with stable use of DPP4is or SUs were identified during 2011–2015 and followed until death or December 31, 2016. The primary outcome was the composite renal outcome. Secondary outcomes included hospitalized heart failure (HHF), major adverse cardiovascular event (MACE), hospitalized hypoglycemia, and all‐cause death. Subdistribution hazard models were employed to assess treatment effects on clinical outcomes. A total of 1,204 matched pairs of DPP4i and SU users were analyzed. Compared with SUs, DPP4is had no significant difference in the risks of the composite renal outcome, HHF, and three‐point and four‐point MACE (hazard ratios (95% confidence intervals): 1.10 (0.93–1.31), 1.11 (0.95–1.30), 0.97 (0.79–1.19), and 1.08 (0.94–1.24), respectively), but reduced risks of hospitalized hypoglycemia (0.53 (0.43–0.64)) and all‐cause death (0.71 (0.53–0.96)). In conclusion, among patients with T2D and advanced CKD, the use of DPP4is vs. SUs was associated with comparable safety profiles on renal and cardiovascular outcomes, and reduced risks of hospitalized hypoglycemia and all‐cause death. DPP4is may be preferred for patients with T2D and advanced CKD, and the regular monitoring on cardiac function remains crucial among this population who are at a higher risk of HHF.","heading_context":"Abstract","domain":"deepblue.lib.umich.edu","title":"Association of Renal and Cardiovascular Safety With DPP‐4 Inhibitors vs. Sulfonylureas in Patients With Type 2 Diabetes and Advanced Chronic Kidney Disease","url":"http://deepblue.lib.umich.edu/bitstream/2027.42/168511/2/cpt2262_am.pdf"},
{"id":"frag_3f1baab2","text_content":"Type 2 diabetes mellitus (T2DM) is a chronic metabolic disorder characterized by hyperglycemia, insulin resistance, and decreased insulin secretion. With its rising global prevalence, effective management strategies are critical to reducing morbidity and mortality. This systematic review compares the efficacy, safety, and long-term outcomes of four major pharmacological treatments for T2DM: sodium-glucose cotransporter-2 (SGLT2) inhibitors, dipeptidyl peptidase-4 (DPP-4) inhibitors, metformin, and insulin. We focused on randomized controlled trials (RCTs) published within the last five years (2019-2024) to provide an up-to-date assessment of glycemic control, cardiovascular and renal benefits, weight effects, and the risk of hypoglycemia. The review highlights that while all four medication classes effectively reduce HbA1c levels, SGLT2 inhibitors stand out for their additional cardiovascular and renal benefits, including significant reductions in major adverse cardiovascular events and chronic kidney disease progression. Metformin remains a cornerstone first-line therapy due to its safety, efficacy, and affordability. DPP-4 inhibitors are a weight-neutral, well-tolerated option, although their efficacy may diminish over time. Insulin, while the most potent glucose-lowering agent, carries a higher risk of hypoglycemia and weight gain. Our findings emphasize the importance of personalized, patient-centered approaches that account for the distinct therapeutic profiles of these treatments. Future research should prioritize head-to-head comparisons and optimal therapy sequencing to refine treatment guidelines for diverse patient populations.","heading_context":"Abstract","domain":"doi.org","title":"Comparing the Efficacy and Long-Term Outcomes of Sodium-Glucose Cotransporter-2 (SGLT2) Inhibitors, Dipeptidyl Peptidase-4 (DPP-4) Inhibitors, Metformin, and Insulin in the Management of Type 2 Diabetes Mellitus","url":"https://doi.org/10.7759/cureus.74400"},
{"id":"frag_3f3c4c19","text_content":"Januvia; Merck and Co Inc, White- house Station, New Jersey) was the first dipeptidyl peptidase-4 inhibitor (DPP-4) to gain approval from the Food and Drug Administration (FDA) in October 2006 for the treatment of type 2 diabetes mellitus. 1In October 2007, approved labeling for sitagliptin was updated to note the appearance of spontaneous adverse event reports of hypersensitivity reactions (ie, anaphylaxis, angioedema, serious skin reactions) and noted that most reported events occurred within the first 3 months after initiation of treatment, including some following the first dose. 1 The objective of our study was to construct a case series of sitagliptin-associated allergic reactions within an empirical model for the assessment of events consistent with drug allergy.Methods.The Adverse Event Reports System (AERS) database of the FDA was searched for all reports of potential drug allergy (including domestic and foreign reporters) with outcomes of (1) death, (2) life-threatening conditions, (3) disability, (4) hospitalization, or (5) intervention required to prevent permanent impairment.Reports of drug allergy occurring within 6 weeks following the initiation of sitagliptin therapy that suggested at least a possible causal relationship between the adverse event and sitagliptin use, as described in the World Health Organization (WHO) criteria, 2 were retained as cases.Previously published criteria were modified for classification of cases into 1 of the following 4 categories to build case definitions suitable for examination of spontaneous adverse event reports, which frequently have partial or limited information.Explicit inclusion and exclusion criteria for each category are outlined as follows:•Anaphylaxis: We defined anaphylaxis as any unexplained episode of hypotension or respiratory compromise with or without angioedema or a clinical diagnosis by a health care professional.Reports that were confounded by a major concurrent illness were excluded.•Angioedema Without Upper Airway Obstruction/ Symptomatology: Patients who rapidly developed unexplained swelling of skin or mucosa without any signs of respiratory compromise were included under this category.We excluded reports of anaphylaxis and angioedema that were confounded by concomitant use of antibiotics or in which therapy with an angiotensinconverting enzyme inhibitor or angiotensin receptor blocker was started within 1 month of onset of the hypersensitivity reaction, since these drugs most commonly cause angioedema during this period.•Serious Skin Reactions: Reports of Stevens-Johnson syndrome or toxic epidermal necrolysis diagnosed by a health","heading_context":"Abstract","domain":"doi.org","title":"Sitagliptin-Associated Drug Allergy: Review of Spontaneous Adverse Event Reports","url":"https://doi.org/10.1001/archinternmed.2010.188"},
{"id":"frag_3f3dd96e","text_content":"Aims – to compare the efficacy of dipeptidyl peptidase 4 (DPP-4) inhibitors in achieving the target for glycated hemoglobin (HbA1c) level in patients with type 2 diabetes by monotherapy or by combination with metformin. Material and methods. This is a systematic review and network meta-analysis of randomized clinical trials (RCTs). Studies on the effectiveness of DPP-4 inhibitors (gliptins) compared with placebo and the combination of DPP-4 inhibitors with metformin compared with metformin were included. The endpoint was the percentage of patients (%) who achieved target HbA1c level. The size effect was represented by the logarithmic scale of the odds ratio (OR). The gliptins were ranked based on the values of surface under the cumulative ranking curve (SUCRA). Results. The 38 RCTs of sitagliptin, vildagliptin, saxagliptin, linagliptin, alogliptin, gozogliptin, evogliptin were analyzed. The results showed a statistically significant benefit of alogliptin in monotherapy (OR compared with placebo – 5.77), in combination with metformin, both in the general population (OR compared with metformin – 7.45), and in naive and non-naive patients (OR – 2.84 and 12.61 compared to metformin, respectively). According to the SUCRA, alogliptin had the highest rating among DPP-4 inhibitors for in all subgroups. Conclusion. Thus, the systematic review showed the superiority of alogliptin over other DPP-4 inhibitors in monotherapy, as well as in combination with metformin, both in the general population and in naive and previously treated subgroups of patients with type 2 diabetes.","heading_context":"Abstract","domain":"umedp.ru","title":"Comparison of the Effectiveness of Dipeptidyl Peptidase 4 Inhibitors in Achieving the Target Level of Glycated Hemoglobin: a Systematic Review and Network Meta-Analysis","url":"https://umedp.ru/upload/iblock/943/Petunina.pdf"},
{"id":"frag_408edeb3","text_content":"Following the launch of the first sodium-glucose co-transporter-2 (SGLT2) inhibitor on April 17, 2014, several other SGLT2 inhibitors have followed over time, so that 6 active pharmaceutical ingredients (APIs)/7 finished pharmaceutical products (FPPs) are currently available for clinical use in Japan. Launched as a class of agents with a novel mechanism of action for the treatment of type 2 diabetes, in clinical trials, these agents have not only been associated with adverse reactions (ARs) common to conventional antidiabetic drugs, e.g., hypoglycemia; they have also been associated with those unique to this class, e.g., urogenital infections. Furthermore, their wideranging and complex influences on metabolism and circulation have raised concern over the occurrence of a wide spectrum of ARs associated with their use, including serious ARs. Indeed, numerous reports of ARs and adverse events (AEs) have followed soon after launch of these agents. This has led to the “Committee on the Proper Use of SGLT2 Inhibitors” (“Committee” hereafter) being launched and the “Recommendations on the Proper Use of SGLT2 Inhibitors” (“Recommendations” hereafter) being developed and published on June 13, 2014. Thereafter, the Recommendations have been revised on August 29, 2014 in light of AEs and ARs reported to date; 3-month post-marketing surveillances (PMSs) have also provided a certain amount of safety data from elderly patients 65 years of age or older receiving SGLT2 inhibitors, demonstrating that the AEs and ARs reported during these surveillances were not widely different in kind and frequency from those reported in the preceding clinical trials. Of note, a majority of these Recommendations apply to the combination drugs (each incorporating an SGLT2 inhibitor and a DPP-4 inhibitor) that have been launched since September 2017, one after another, by pharmaceutical companies, for the treatment of type 2 diabetes. Again, while some SGLT2 inhibitors have been granted approval for use in combination with insulin formulations in adult patients with type 1 diabetes since December 2018, reports have demonstrated an increased risk of ketoacidosis associated with this combined use. In addition, the applications filed overseas for approval of SGLT2 inhibitors in adult patients with type 1 diabetes have met with conditional (European Medicine Agency [EMA] approval limiting their use to patients with body mass index (BMI) ≥ 27 kg/m) or no (U. S. Food and Drug Administration [FDA]) approval. In light of these developments which need to be taken seriously, it appears that sufficient care, as well as emergency measures, needs to be taken when it comes to using SGLT2 inhibitors in patients with type 1 diabetes. Thus, the Committee hereby updates its Recommendations to promote the proper use of SGLT2 inhibitors This article is the English version of the “Recommendations on the Proper Use of SGLT2 Inhibitors” (http://www.fa.kyorin.co.jp/jds/uploads/recommendation_SGLT2.pdf) released in Japanese on August 6, 2019 on the official website of the Japan Diabetes Society, and has been jointly published in Diabetology International (the official English journal of the Japan Diabetes Society: https://doi.org/10.1007/s13340-019-00415-8) and Journal of Diabetes Investigation (the official journal of AASD). Received 11 October 2019; accepted 11 October 2019","heading_context":"Abstract","domain":"www.ncbi.nlm.nih.gov","title":"Recommendations on the Proper Use of SGLT2 Inhibitors","url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6942057"},
{"id":"frag_4466dfb3","text_content":"IntroductionTreatment-related quality of life (QOL) is an important aspect of diabetes management. Here, we investigated the influence of sitagliptin, a dipeptidyl peptidase-4 inhibitor, on treatment-related QOL in patients with type 2 diabetes mellitus treated with insulin.MethodsThis was a prespecified sub-analysis of the Sitagliptin Preventive Study of Intima-Media Thickness Evaluation (SPIKE). The study population consisted of 71 subjects in the sitagliptin group, and 62 subjects in the conventional group who were treated with insulin. Patients of the sitagliptin group were started on sitagliptin in addition to ongoing insulin therapy. In the conventional group, either increasing the dose of current insulin therapy or the addition of oral hypoglycemic agents other than dipeptidyl peptidase-4 inhibitors was allowed to achieve glycemic control. Treatment-related QOL was evaluated before and 104 weeks after the initiation of the study using the Diabetes Therapy-Related QOL Questionnaire 7 (DTR-QOL7).ResultsForty-five out of 71 subjects in the sitagliptin group and 41 out of 62 subjects in the conventional group filled out the QOL questionnaire at week 104. The DTR-QOL7 score at week 104 was significantly increased from baseline in the sitagliptin group, while that in the conventional group was not changed. However, the changes in score did not differ between the two groups. Change in HbA1c was negatively associated with change in score.ConclusionsOur data suggest that sitagliptin added to insulin treatment was comparable to other treatments in terms of its impact on treatment-related QOL.Clinical Trial RegistrationClinicalTrials.gov identifier: UMIN000007396.FundingMitsubishi Tanabe Pharma Co., Ono Pharmaceutical Co., and Novo Nordisk.","heading_context":"Abstract","domain":"link.springer.com","title":"The Influence of Sitagliptin on Treatment-Related Quality of Life in Patients with Type 2 Diabetes Mellitus Receiving Insulin Treatment: A Prespecified Sub-Analysis","url":"https://link.springer.com/content/pdf/10.1007%2Fs13300-017-0267-2.pdf"},
{"id":"frag_4ce95e6c","text_content":"The American Diabetes Association and the European Association for the Study of Diabetes convened a panel to update the prior position statements, published in 2012 and 2015, on the management of type 2 diabetes in adults. A systematic evaluation of the literature since 2014 informed new recommendations. These include additional focus on lifestyle management and diabetes self-management education and support. For those with obesity, efforts targeting weight loss, including lifestyle, medication, and surgical interventions, are recommended. With regards to medication management, for patients with clinical cardiovascular disease, a sodium–glucose cotransporter 2 (SGLT2) inhibitor or a glucagon-like peptide 1 (GLP-1) receptor agonist with proven cardiovascular benefit is recommended. For patients with chronic kidney disease or clinical heart failure and atherosclerotic cardiovascular disease, an SGLT2 inhibitor with proven benefit is recommended. GLP-1 receptor agonists are generally recommended as the first injectable medication.","heading_context":"Abstract","domain":"care.diabetesjournals.org","title":"Management of Hyperglycemia in Type 2 Diabetes, 2018. A Consensus Report by the American Diabetes Association (ADA) and the European Association for the Study of Diabetes (EASD)","url":"https://care.diabetesjournals.org/content/diacare/41/12/2669.full.pdf"},
{"id":"frag_5b8366b0","text_content":"In recent years the incretin therapies have provided a new treatment option for patients with type 2 diabetes mellitus (T2DM). The incretin therapies focus on the increasing levels of the two incretin hormones, glucagon-like peptide 1 (GLP-1) and glucose-dependent insulinotropic polypeptide (GIP). This results in increased glucose dependent insulin synthesis and release. GLP-1 receptor agonists such as liraglutide and exenatide exert an intrinsic biological effect on GLP-1 receptors directly stimulating the release of insulin from pancreatic beta cells. DPP-4 inhibitors such as sitagliptin and linagliptin prevent the inactivation of endogenous GLP-1 and GIP through competitive inhibition of the DPP-4 enzyme. Both incretin therapies have good safety and tolerability profiles and interact minimally with a number of medications commonly prescribed in T2DM. This paper focuses on the pharmacological basis by which the incretin therapies function and how this knowledge can inform and benefit clinical decisions. Each individual incretin agent has benefits and pitfalls relating to aspects such as glycaemic and nonglycaemic efficacy, safety and tolerability, ease of administration, and cost. Overall, a personalized medicine approach has been found to be favourable, tailoring the incretin agent to benefit and suit patient's needs such as renal impairment (RI) or hepatic impairment (HI).","heading_context":"Abstract","domain":"downloads.hindawi.com","title":"Choosing between GLP-1 Receptor Agonists and DPP-4 Inhibitors: A Pharmacological Perspective","url":"https://downloads.hindawi.com/journals/jnme/2012/381713.pdf"},
{"id":"frag_64c3d41b","text_content":"\n\nDiabetes mellitus continues to be a major health concern worldwide, contributing significantly\nto annual mortality and morbidity. Among all types of diabetes mellitus, type 2 diabetes mellitus\nis a pervasive health condition that affects people worldwide. Recently, various classes of drugs\nhave been proposed for the management of T2DM. Dipeptidyl peptidase-4 inhibitors or gliptins are a\nclass of oral medications for T2DM that target the incretin hormones GLP-1 and GIP. By increasing\ninsulin production and decreasing glucagon release, DPP-4 inhibitors maintain glucose homeostasis.\nDPP-4 inhibitors provide a number of advantages over conventional antidiabetic medications, including\na reduced risk of hypoglycaemic episodes, an extensive safety profile, and no weight gain. Consequently,\ngliptins have been a focus of study. This paper provides an overview of diabetes mellitus,\nfocusing on its types, prevalence, and therapeutic approaches, particularly in the context of type 2 diabetes\nmellitus (T2DM). The synthesis of key DPP-4 inhibitors, including sitagliptin, vildagliptin,\nsaxagliptin, linagliptin, and alogliptin is discussed, showcasing various synthetic strategies employed\nby different researchers to produce these drugs.\n","heading_context":"Abstract","domain":"doi.org","title":"Synthetic Overview of FDA-Approved Dipeptidyl Peptidase-4 Inhibitors (DPP-4I)","url":"https://doi.org/10.2174/0115734080339904250219061503"},
{"id":"frag_66869a06","text_content":"Background: Dipeptidyl peptidase-4 (DPP-4) inhibitors are oral antihyperglycemic agents commonly prescribed for type 2 diabetes (T2DM). Due to the intricate relationship between glucose regulation and cardiovascular diseases (CVDs), DPP-4 inhibitors have attracted attention for their cardiovascular safety and efficacy. This bibliometric analysis aims to provide insights into the global research landscape on DPP-4 inhibitors and cardiovascular outcomes (CVOs). Methods: A bibliometric analysis was performed, using the Web of Science Core Collection. Data were analyzed using VOSviewer, CiteSpace, and Biblioshiny. Results: The United States led in publication output, followed by Japan and China. Harvard University and the University of Toronto were the leading institutions. The most influential journals were Cardiovascular Diabetology and Diabetes Obesity & Metabolism. Darren K. McGuire was the most prolific author followed by Rury R. Holman. The most commonly occurring keyword was heart failure. Cluster analysis revealed key thematic areas in the field, including “incretin-based therapy,” “dipeptidyl peptidase-4 inhibition,” and “cardiovascular safety.” Emerging clusters, such as “atrial fibrillation,” have gained attention in recent years, highlighting evolving areas of investigation. Conclusion: This study underscores the importance of CVOs in the research on DPP-4 inhibitors. The high frequency of keywords such as “heart failure,” along with recent terms like “mortality” and “risk,” highlights a strong focus on cardiovascular safety and complications in the literature. Our analysis reflected that most studies address these critical aspects of cardiovascular health, discussing the potential role of DPP-4 inhibitors in mitigating adverse outcomes, particularly in patients with T2DM.","heading_context":"Abstract","domain":"doi.org","title":"Global research trends on DPP-4 inhibitors and cardiovascular outcomes: a comprehensive bibliometric analysis","url":"https://doi.org/10.1097/ms9.0000000000003089"},
{"id":"frag_66e5508f","text_content":"Objective Several clinical studies have reported the application of dipeptidyl peptidase-4 (DPP-4) inhibitors as treatments for type 1 diabetes mellitus (T1DM). This study aims to review the outcomes of these existing studies and to discuss the therapeutic effects of DPP-4 inhibitors on T1DM. Methods We thoroughly searched the Medline, Embase, PubMed, and Cochrane Library databases and ClinicalTrials.gov for studies concerning the use of DPP-4 inhibitors in patients with T1DM. Results In preclinical trials, DPP-4 inhibitors improved the pathogenesis of T1DM. However, only a portion of the studies showed potential efficacy regarding clinical glycemic control and other clinical parameters. From this meta-analysis, pooled data from 5 randomized controlled trials revealed that the additional use of DPP-4 inhibitors resulted in a greater decrease in glycated hemoglobin A1c (HbA1c) levels (0.07%, 95% CI (−0.37%–0.23%)) than insulin monotherapy, although the decrease was not significant. A small decrease in postprandial glucose or insulin consumption was confirmed. Conclusion Although DPP-4 inhibitors may be beneficial for T1DM, existing studies do not strongly support these positive effects in clinical practice. Further optimized clinical trials are needed.","heading_context":"Abstract","domain":"downloads.hindawi.com","title":"DPP-4 Inhibitors as Treatments for Type 1 Diabetes Mellitus: A Systematic Review and Meta-Analysis","url":"http://downloads.hindawi.com/journals/jdr/2018/5308582.pdf"},
{"id":"frag_67c77d51","text_content":"The discovery of glucagon-like peptide-1 (GLP-1), an incretin hormone with important effects on glycemic control and body weight regulation, led to efforts to extend its half-life and make it therapeutically effective in people with type 2 diabetes (T2D). The development of short- and then long-acting GLP-1 receptor agonists (GLP-1RAs) followed. Our article charts the discovery and development of the long-acting GLP-1 analogs liraglutide and, subsequently, semaglutide. We examine the chemistry employed in designing liraglutide and semaglutide, the human and non-human studies used to investigate their cellular targets and pharmacological effects, and ongoing investigations into new applications and formulations of these drugs. Reversible binding to albumin was used for the systemic protraction of liraglutide and semaglutide, with optimal fatty acid and linker combinations identified to maximize albumin binding while maintaining GLP-1 receptor (GLP-1R) potency. GLP-1RAs mediate their effects via this receptor, which is expressed in the pancreas, gastrointestinal tract, heart, lungs, kidneys, and brain. GLP-1Rs in the pancreas and brain have been shown to account for the respective improvements in glycemic control and body weight that are evident with liraglutide and semaglutide. Both liraglutide and semaglutide also positively affect cardiovascular (CV) outcomes in individuals with T2D, although the precise mechanism is still being explored. Significant weight loss, through an effect to reduce energy intake, led to the approval of liraglutide (3.0 mg) for the treatment of obesity, an indication currently under investigation with semaglutide. Other ongoing investigations with semaglutide include the treatment of non-alcoholic fatty liver disease (NASH) and its use in an oral formulation for the treatment of T2D. In summary, rational design has led to the development of two long-acting GLP-1 analogs, liraglutide and semaglutide, that have made a vast contribution to the management of T2D in terms of improvements in glycemic control, body weight, blood pressure, lipids, beta-cell function, and CV outcomes. Furthermore, the development of an oral formulation for semaglutide may provide individuals with additional benefits in relation to treatment adherence. In addition to T2D, liraglutide is used in the treatment of obesity, while semaglutide is currently under investigation for use in obesity and NASH.","heading_context":"Abstract","domain":"www.frontiersin.org","title":"The Discovery and Development of Liraglutide and Semaglutide","url":"https://www.frontiersin.org/articles/10.3389/fendo.2019.00155/pdf"},
{"id":"frag_69bbf519","text_content":"BACKGROUND\nDiabetes is the commonest cause of chronic kidney disease (CKD). Both conditions commonly co-exist. Glucometabolic changes and concurrent dialysis in diabetes and CKD make glucose-lowering challenging, increasing the risk of hypoglycaemia. Glucose-lowering agents have been mainly studied in people with near-normal kidney function. It is important to characterise existing knowledge of glucose-lowering agents in CKD to guide treatment.\n\n\nOBJECTIVES\nTo examine the efficacy and safety of insulin and other pharmacological interventions for lowering glucose levels in people with diabetes and CKD.\n\n\nSEARCH METHODS\nWe searched the Cochrane Kidney and Transplant Register of Studies up to 12 February 2018 through contact with the Information Specialist using search terms relevant to this review. Studies in the Register are identified through searches of CENTRAL, MEDLINE, and EMBASE, conference proceedings, the International Clinical Trials Register (ICTRP) Search Portal and ClinicalTrials.gov.\n\n\nSELECTION CRITERIA\nAll randomised controlled trials (RCTs) and quasi-RCTs looking at head-to-head comparisons of active regimens of glucose-lowering therapy or active regimen compared with placebo/standard care in people with diabetes and CKD (estimated glomerular filtration rate (eGFR) < 60 mL/min/1.73 m2) were eligible.\n\n\nDATA COLLECTION AND ANALYSIS\nFour authors independently assessed study eligibility, risk of bias, and quality of data and performed data extraction. Continuous outcomes were expressed as post-treatment mean differences (MD). Adverse events were expressed as post-treatment absolute risk differences (RD). Dichotomous clinical outcomes were presented as risk ratios (RR) with 95% confidence intervals (CI).\n\n\nMAIN RESULTS\nForty-four studies (128 records, 13,036 participants) were included. Nine studies compared sodium glucose co-transporter-2 (SGLT2) inhibitors to placebo; 13 studies compared dipeptidyl peptidase-4 (DPP-4) inhibitors to placebo; 2 studies compared glucagon-like peptide-1 (GLP-1) agonists to placebo; 8 studies compared glitazones to no glitazone treatment; 1 study compared glinide to no glinide treatment; and 4 studies compared different types, doses or modes of administration of insulin. In addition, 2 studies compared sitagliptin to glipizide; and 1 study compared each of sitagliptin to insulin, glitazars to pioglitazone, vildagliptin to sitagliptin, linagliptin to voglibose, and albiglutide to sitagliptin. Most studies had a high risk of bias due to funding and attrition bias, and an unclear risk of detection bias.Compared to placebo, SGLT2 inhibitors probably reduce HbA1c (7 studies, 1092 participants: MD -0.29%, -0.38 to -0.19 (-3.2 mmol/mol, -4.2 to -2.2); I2 = 0%), fasting blood glucose (FBG) (5 studies, 855 participants: MD -0.48 mmol/L, -0.78 to -0.19; I2 = 0%), systolic blood pressure (BP) (7 studies, 1198 participants: MD -4.68 mmHg, -6.69 to -2.68; I2 = 40%), diastolic BP (6 studies, 1142 participants: MD -1.72 mmHg, -2.77 to -0.66; I2 = 0%), heart failure (3 studies, 2519 participants: RR 0.59, 0.41 to 0.87; I2 = 0%), and hyperkalaemia (4 studies, 2788 participants: RR 0.58, 0.42 to 0.81; I2 = 0%); but probably increase genital infections (7 studies, 3086 participants: RR 2.50, 1.52 to 4.11; I2 = 0%), and creatinine (4 studies, 848 participants: MD 3.82 μmol/L, 1.45 to 6.19; I2 = 16%) (all effects of moderate certainty evidence). SGLT2 inhibitors may reduce weight (5 studies, 1029 participants: MD -1.41 kg, -1.8 to -1.02; I2 = 28%) and albuminuria (MD -8.14 mg/mmol creatinine, -14.51 to -1.77; I2 = 11%; low certainty evidence). SGLT2 inhibitors may have little or no effect on the risk of cardiovascular death, hypoglycaemia, acute kidney injury (AKI), and urinary tract infection (low certainty evidence). It is uncertain whether SGLT2 inhibitors have any effect on death, end-stage kidney disease (ESKD), hypovolaemia, fractures, diabetic ketoacidosis, or discontinuation due to adverse effects (very low certainty evidence).Compared to placebo, DPP-4 inhibitors may reduce HbA1c (7 studies, 867 participants: MD -0.62%, -0.85 to -0.39 (-6.8 mmol/mol, -9.3 to -4.3); I2 = 59%) but may have little or no effect on FBG (low certainty evidence). DPP-4 inhibitors probably have little or no effect on cardiovascular death (2 studies, 5897 participants: RR 0.93, 0.77 to 1.11; I2 = 0%) and weight (2 studies, 210 participants: MD 0.16 kg, -0.58 to 0.90; I2 = 29%; moderate certainty evidence). Compared to placebo, DPP-4 inhibitors may have little or no effect on heart failure, upper respiratory tract infections, and liver impairment (low certainty evidence). Compared to placebo, it is uncertain whether DPP-4 inhibitors have any effect on eGFR, hypoglycaemia, pancreatitis, pancreatic cancer, or discontinuation due to adverse effects (very low certainty evidence).Compared to placebo, GLP-1 agonists probably reduce HbA1c (7 studies, 867 participants: MD -0.53%, -1.01 to -0.06 (-5.8 mmol/mol, -11.0 to -0.7); I2 = 41%; moderate certainty evidence) and may reduce weight (low certainty evidence). GLP-1 agonists may have little or no effect on eGFR, hypoglycaemia, or discontinuation due to adverse effects (low certainty evidence). It is uncertain whether GLP-1 agonists reduce FBG, increase gastrointestinal symptoms, or affect the risk of pancreatitis (very low certainty evidence).Compared to placebo, it is uncertain whether glitazones have any effect on HbA1c, FBG, death, weight, and risk of hypoglycaemia (very low certainty evidence).Compared to glipizide, sitagliptin probably reduces hypoglycaemia (2 studies, 551 participants: RR 0.40, 0.23 to 0.69; I2 = 0%; moderate certainty evidence). Compared to glipizide, sitagliptin may have had little or no effect on HbA1c, FBG, weight, and eGFR (low certainty evidence). Compared to glipizide, it is uncertain if sitagliptin has any effect on death or discontinuation due to adverse effects (very low certainty).For types, dosages or modes of administration of insulin and other head-to-head comparisons only individual studies were available so no conclusions could be made.\n\n\nAUTHORS' CONCLUSIONS\nEvidence concerning the efficacy and safety of glucose-lowering agents in diabetes and CKD is limited. SGLT2 inhibitors and GLP-1 agonists are probably efficacious for glucose-lowering and DPP-4 inhibitors may be efficacious for glucose-lowering. Additionally, SGLT2 inhibitors probably reduce BP, heart failure, and hyperkalaemia but increase genital infections, and slightly increase creatinine. The safety profile for GLP-1 agonists is uncertain. No further conclusions could be made for the other classes of glucose-lowering agents including insulin. More high quality studies are required to help guide therapeutic choice for glucose-lowering in diabetes and CKD.","heading_context":"Abstract","domain":"europepmc.org","title":"Insulin and glucose-lowering agents for treating people with diabetes and chronic kidney disease.","url":"https://europepmc.org/articles/pmc6513625?pdf=render"},
{"id":"frag_6c03e531","text_content":"\n Background: Dipeptidyl-peptidase IV inhibitor (DPP-4i) is a common hypoglycemic medication in treating type 2 diabetes millitus (T2DM). It has become widely utilized in clinical practice due to its ability to effectively manage blood glucose while posing a low risk of hypoglycemia and weight gain. However, there is no consensus on DPP-4i's pancreatic safety due to a paucity of clinical evidence. The safe event appears to be easily overlooked. This review aims to evaluate the pancreatic safety of DPP-4i in patients with type 2 diabetes mellitus using the standard pairwise and network meta-analysis (NMA) methods.Methods: MEDLINE, Embase, Pubmed, Web of Science, and the Cochrane Central Register of Controlled Trials will be used to search for published literature and clinical trial registries (such as www.ClinicalTrials.gov) will be used to look for unpublished trials. English-language randomized controlled trials (RCTs) will be included. Two independent reviewers will screen literature for eligibility, extract available data, and assess the risk of bias. All divergences will be resolved after rechecking the source papers and further discussion among the reviewers with a complete consensus before inclusion. Pancreatic safety events involving acute pancreatitis, chronic pancreatitis, and pancreatic cancer will be the primary outcome. The secondary result will be the change in pancreatic enzyme from the baseline. A random-effects model will be used for pairwise meta-analysis with a 95% confidence interval, and Bayesian network meta-analysis will be conducted between the various interventions.Discussion: This systematic review and network meta-analysis will evaluate the pancreatic safety of DPP-4i in patients with type 2 diabetes millitus. The findings of this study may supplement the evidence-based information on DPP-4i, improve existing understanding of this issue, and assist patients and clinicians in making better treatment decisions by raising their awareness of the problem. Systematic review registration: submitted in PROSPERO, 31 August 2021","heading_context":"Abstract","domain":"doi.org","title":"Pancreatic Safety of DPP-4 Inhibitors in Type 2 Diabetes Millitus—Protocol for a Systematic Review and Network Meta-Analysis of Randomized Controlled Trials","url":"https://doi.org/10.21203/rs.3.rs-1047322/v1"},
{"id":"frag_70193d51","text_content":"Objective: To estimate the prevalence of vitamin B12 deficiency in type 2 diabetes mellitus patients receiving metformin and metformin in combination with DPP-4 inhibitors. To evaluate the vitamin B12 levels induced by long-term metformin usage.\nMethods: It is a retrospective, comparative study of 6 mo, conducted at Shadan Institute of Medical Sciences, Hyderabad. 300 diabetic patients of age group between 30-85 y of either gender were divided into Group-A, receiving metformin and Group-B, receiving metformin+DPP-4 inhibitors. Ethics committee approval was o btained. The baseline and after 6 mo values of Vitamin B12 were noted and analyzed by using SPSS software.\nResults: The majority of the patients were from the age group of 56-65 y (n=42, 28%) in Group-A and 46-55 y (n=61, 40.7%) in Group B. Male predominance was observed in both groups (n=81, 54% and n=76, 50.7%). Duration of Diabetes mellitus was ≤5 y in both groups (n=87, 58% and n=112, 74.7%). Vitamin B12 mean values for Group-A (Baseline-478.61, After 6 mo-195.94) and Group-B (Baseline-527.82, After 6 mo-299.05) were obtained. Mean reduction with a statistical significance in both study groups was observed (Group-A-282.66 and Group-B-228.77). Most of the patients showed numbness (14%) in Group-A and general weakness (7.3%) in Group B, respectively.\nConclusion: Type 2 diabetic patients who were on metformin therapy only have a prevalence of vitamin B12 deficiency compared to Metformin in combination with DPP-4 inhibitors receiving patients.","heading_context":"Abstract","domain":"journals.innovareacademics.in","title":"COMPARATIVE STUDY OF VITAMIN B12 DEFICIENCY ASSOCIATED WITH METFORMIN AND METFORMIN IN COMBINATION WITH DPP-4 INHIBITORS IN A TERTIARY CARE HOSPITAL","url":"https://journals.innovareacademics.in/index.php/ijpps/article/download/47818/28831"},
{"id":"frag_738ec107","text_content":"Introduction The effects of switching DPP-4 inhibitors in type 2 diabetes mellitus (T2DM) patients are being widely studied. However, information of which factors affect the therapeutic response is limited. We evaluated the difference in HbA1c lowering effect by comorbidity and other variables after switching to anagliptin in patients with T2DM inadequately controlled by other DPP-4 inhibitors. Methods In a multicenter, open-label, single-arm, prospective observational study, patients with T2DM, HbA1c ≥ 7.0% who have taken DPP-4 inhibitors other than anagliptin, either alone or in combination (DPP-4 inhibitors + metformin/sulfonylurea (SU)/thiazolidinedione (TZD)/insulin), for at least 8 weeks were enrolled. After the switch to anagliptin, HbA1c and available clinical characteristics were determined. Results The change in HbA1c levels from baseline to week 12 and 24 was − 0.40% and − 0.42% in all patients. However, comparing the subgroups without and with comorbidities, the change in HbA1c levels at weeks 12 and 24 was − 0.68% and − 0.89% vs. − 0.27% and 0.22%, respectively. In addition, the proportion of patients achieving HbA1c < 7% from baseline to week 12 and 24 was increased to 70% and 70% vs. 20% and 24%, respectively. Duration of T2DM and different subtype classes of DPP-4 inhibitor did not significantly contribute to the change in HbA1c. Conclusion In patients with T2DM poorly controlled by other DPP-4 inhibitors, HbA1c levels were significantly decreased after switching to anagliptin. Given that the change in HbA1c was greater in patients without comorbidities than in patients with comorbidities, switching to anagliptin before adding other oral hypoglycemic agents (OHAs) may be an option in patients without comorbidities.","heading_context":"Abstract","domain":"link.springer.com","title":"Therapeutic Effects of Switching to Anagliptin from Other DPP-4 Inhibitors in T2DM Patients with Inadequate Glycemic Control: A Non-interventional, Single-Arm, Open-Label, Multicenter Observational Study","url":"https://link.springer.com/content/pdf/10.1007/s13300-022-01339-4.pdf"},
{"id":"frag_74d39123","text_content":"Introduction Diabetes Mellitus (DM) constitutes a global epidemic and is one of the top ten leading causes of mortality (WHO, 2019), projected to rank seventh by 2030. The US National Diabetes Statistics Report (2021) states that 38.4 million Americans have diabetes. Dipeptidyl Peptidase-4 (DPP-4) is an FDA-approved target for the treatment of type 2 diabetes mellitus (T2DM). However, current DPP-4 inhibitors may cause adverse effects, including gastrointestinal issues, severe joint pain (FDA safety warning), nasopharyngitis, hypersensitivity, and nausea. Moreover, the development of novel drugs and the in vivo assessment of DPP-4 inhibition are both costly and often impractical. These challenges highlight the urgent need for efficient in-silico approaches to facilitate the discovery and optimization of safer and more effective DPP-4 inhibitors. Methodology Quantitative Structure-Activity Relationship (QSAR) modeling is a widely used computational approach for evaluating the properties of chemical substances. In this study, we employed a Neuro-symbolic (NeSy) approach, specifically the Logic Tensor Network (LTN), to develop a DPP-4 QSAR model capable of identifying potential small-molecule inhibitors and predicting bioactivity classification. For comparison, we also implemented baseline models using Deep Neural Networks (DNNs) and Transformers. A total of 6,563 bioactivity records (SMILES-based compounds with IC50 values) were collected from ChEMBL, PubChem, BindingDB, and GTP. Feature sets used for model training included descriptors (CDK Extended–PaDEL), fingerprints (Morgan), chemical language model embeddings (ChemBERTa-2), LLaMa 3.2 embedding features, and physicochemical properties. Results Among all tested configurations, the Neuro-symbolic QSAR model (NeSyDPP-4) performed best using a combination of CDK extended and Morgan fingerprints. The model achieved an accuracy of 0.9725, an F1-score of 0.9723, an ROC AUC of 0.9719, and a Matthews correlation coefficient (MCC) of 0.9446. These results outperformed the baseline DNN and Transformer models, as well as existing state-of-the-art (SOTA) methods. To further validate the robustness of the model, we conducted an external evaluation using the Drug Target Common (DTC) dataset, where NeSyDPP-4 also demonstrated strong performance, with an accuracy of 0.9579, an AUC-ROC of 0.9565, a Matthews Correlation Coefficient (MCC) of 0.9171, and an F1-score of 0.9577. Discussion These findings suggest that the NeSyDPP-4 model not only delivered high predictive performance but also demonstrated generalizability to external datasets. This approach presents a cost-effective and reliable alternative to traditional vivo screening, offering valuable support for the identification and classification of biologically active DPP-4 inhibitors in the treatment of type 2 diabetes mellitus (T2DM).","heading_context":"Abstract","domain":"doi.org","title":"NeSyDPP-4: discovering DPP-4 inhibitors for diabetes treatment with a neuro-symbolic AI approach","url":"https://doi.org/10.3389/fbinf.2025.1603133"},
{"id":"frag_7b47af66","text_content":"Background and Aims Incretin-based therapies, including glucagon-like peptide 1 receptor agonists (GLP-1 RAs) and dipeptidyl peptidase-4 (DPP-4) inhibitors, are essential treatments in diabetes management due to their efficacy in glycemic control and the additional benefits of GLP-1 RAs, which include cardiovascular and renal protection. However, concerns about potential associations with biliary disorders necessitate ongoing pharmacovigilance. This study analyzes the link between these drugs and biliary adverse events (AEs) using the FDA Adverse Event Reporting System (FAERS) to enhance clinical safety. Methods We extracted AE data for GLP-1 RAs and DPP-4 inhibitors from FAERS between Q1 2013 and Q1 2024 using OpenVigil 2.1. Analytical methods such as the Reporting Odds Ratio (ROR), Proportional Reporting Ratio (PRR), Bayesian Confidence Propagation Neural Network (BCPNN), and Empirical Bayesian Geometric Mean (EBGM) were employed to assess AE risk. Results A search of biliary disorders by standard MedDRA analytical queries (SMQs) identified 2,215 reports of biliary AEs, with 1,709 related to GLP-1 RAs and 506 to DPP-4 inhibitors. DPP-4 inhibitors showed a significant association with biliary disorders (ROR, 3.09; 95% CI, 2.83–3.37), particularly sitagliptin (ROR, 3.46; 95% CI, 3.13–3.83). Although the overall association for GLP-1 RAs (ROR, 1.60; 95% CI, 1.52–1.68) was not significant, semaglutide (ROR, 4.06; 95% CI, 3.76–4.39) and liraglutide (ROR, 3.88; 95% CI, 3.50–4.29) indicated a notable risk. The SMQ subgroup analyses of sitagliptin, semaglutide, and liraglutide with the SMQ subgroup categories of “biliary tract disorders,” “gallbladder related disorders,” “gallstone related disorders,” and “infectious biliary disorders’ demonstrated a statistically significant correlation. Notably, liraglutide, alogliptin, sitagliptin, and linagliptin were linked to “biliary malignant tumors” with statistical significance. The proportion of serious outcomes was higher for DPP-4 inhibitors (n = 389, 76.88%) compared to GLP-1 RAs (n = 881, 51.55%). Conclusion DPP-4 inhibitors are potentially linked to biliary disorders, warranting vigilance. While the overall association for GLP-1 RAs was not significant, specific drugs like semaglutide, liraglutide, and sitagliptin showed concerning signals, suggesting a need for heightened awareness among clinicians regarding the risk of biliary AEs.","heading_context":"Abstract","domain":"doi.org","title":"Association between GLP-1 RAs and DPP-4 inhibitors with biliary disorders: pharmacovigilance analysis","url":"https://doi.org/10.3389/fphar.2025.1509561"},
{"id":"frag_7b4df391","text_content":"Abstract Sodium-glucose co-transporter 2 (SGLT-2) inhibitors and dipeptidyl peptidase 4 (DPP-4) inhibitors are both novel and second-line therapies in type 2 diabetes mellitus, yet no well-rounded comparison of these two drugs has been published. Upon searching randomized controlled trials in databases from inception to July 2018, we collected studies on the efficacy or safety of SGLT-2 inhibitors compared with those of DPP-4 inhibitors for the treatment of type 2 diabetes mellitus. A total of 12 randomized controlled studies including 4342 patients were included in this meta-analysis. Compared with DPP-4 inhibitors, SGLT-2 inhibitors achieved greater reductions in HbA1c (SMD –0.22; 95% CI: –0.30, –0.14; p=0.000) and fasting plasma glucose (SMD –0.48; 95% CI: –0.56, –0.41; p=0.000). In addition, these reductions increased with a prolonged treatment duration from 12 to 78 weeks. Geographically, significant reductions of SGLT-2 inhibitors in HbA1c and FPG were found in North America and Europe, but not in Asia. Furthermore, SGLT-2 inhibitors showed greater reductions in body weight (SMD −0.72; 95% CI: –0.81, –0.63; p=0.000) from baseline, with an increased incidence of genital infections (OR 4.49; 95% CI: 2.96, 6.83; p=0.000) and pollakiuria (OR 2.24; 95% CI: 1.05, 4.79; p=0.037) and a decreased incidence of hypertension and hyperglycemia. Overall, the current meta-analysis demonstrated that compared to DPP-4 inhibitors, SGLT-2 inhibitors have beneficial effects on HbA1c, FPG, body weight, SBP, DBP, and HDL-cholesterol in patients with type 2 diabetes. However, SGLT-2 inhibitors are associated with increased total cholesterol and LDL-cholesterol and a higher incidence of genital infections and pollakiuria.","heading_context":"Abstract","domain":"doi.org","title":"SGLT-2 Inhibitors and DPP-4 Inhibitors as Second-Line Drugs in Patients with Type 2 Diabetes: A Meta-Analysis of Randomized Clinical Trials","url":"https://doi.org/10.1055/a-0733-7919"},
{"id":"frag_88b84cf4","text_content":"Type 2 diabetes mellitus is one of the most common diseases of the 21st century, caused by a sedentary lifestyle, poor diet, high blood pressure, family history, and obesity. To date, there are no known complete cures for type 2 diabetes. To identify bioactive natural products (NPs) to manage type 2 diabetes, the NPs from the ZINC15 database (ZINC-NPs DB) were screened using a 3D shape similarity search, molecular docking approaches, and ADMETox approaches. Frequently, in silico studies result in asymmetric structures as “hit” molecules. Therefore, the asymmetrical FDA-approved diabetes drugs linagliptin (8-[(3R)-3-aminopiperidin-1-yl]-7-but-2-ynyl-3-methyl-1-[(4-methylquinazolin-2-yl)methyl]purine-2,6-dione), sitagliptin ((3R)-3-amino-1-[3-(trifluoromethyl)-6,8-dihydro-5H-[1,2,4]triazolo[4,3-a]pyrazin-7-yl]-4-(2,4,5-trifluorophenyl)butan-1-one), and alogliptin (2-[[6-[(3R)-3-aminopiperidin-1-yl]-3-methyl-2,4-dioxopyrimidin-1-yl]methyl]benzonitrile) were used as queries to virtually screen the ZINC-NPs DB and detect novel potential dipeptidyl peptidase-4 (DPP-4) inhibitors. The most promising NPs, characterized by the best sets of similarity and ADMETox features, were used during the molecular docking stage. The results highlight that 11 asymmetrical NPs out of 224,205 NPs are potential DPP-4 candidates from natural sources and deserve consideration for further in vitro/in vivo tests.","heading_context":"Abstract","domain":"www.mdpi.com","title":"Natural Compounds as DPP-4 Inhibitors: 3D-Similarity Search, ADME Toxicity, and Molecular Docking Approaches","url":"https://www.mdpi.com/2073-8994/14/9/1842/pdf?version=1662428970"},
{"id":"frag_8ace94fb","text_content":"The fast spread of coronavirus 2019 (COVID-19) calls for immediate action to counter the associated significant loss of human life and deep economic impact. Certain patient populations like those with obesity and diabetes are at higher risk for acquiring severe COVID-19 disease and have a higher risk of COVID-19 associated mortality. In the absence of an effective and safe vaccine, the only immediate promising approach is to repurpose an existing approved drug. Several drugs have been proposed and tested as adjunctive therapy for COVID-19. Among these drugs are the glucagon-like peptide-1 (GLP-1) 2 agonists and the dipeptidylpeptidase-4 (DPP-4) inhibitors. Beyond their glucose-lowering effects, these drugs have several pleiotropic protective properties, which include cardioprotective effects, anti-inflammatory and immunomodulatory activities, antifibrotic effects, antithrombotic effects, and vascular endothelial protective properties. This narrative review discusses these protective properties and addresses their scientific plausibility for their potential use as adjunctive therapy for COVID-19 disease.","heading_context":"Abstract","domain":"doi.org","title":"Anti-Diabetic Drugs GLP-1 Agonists and DPP-4 Inhibitors may Represent Potential Therapeutic Approaches for COVID-19.","url":"https://doi.org/10.2174/1871530321666210809153558"},
{"id":"frag_8dacff42","text_content":"In the time-to-event analysis, the rate of the first occurrence of death from cardiovascular causes, nonfatal myocardial infarction, or nonfatal stroke among patients with type 2 diabetes mellitus was lower with liraglutide than with placebo. (Funded by Novo Nordisk and the National Institutes of Health; LEADER ClinicalTrials.gov number, NCT01179048.).","heading_context":"Abstract","domain":"www.nejm.org","title":"Liraglutide and Cardiovascular Outcomes in Type 2 Diabetes","url":"https://www.nejm.org/doi/pdf/10.1056/NEJMoa1603827?articleTools=true"},
{"id":"frag_90336b56","text_content":"\n \n \n Dipeptidyl peptidase-4 (DPP-4) inhibitors have been shown to mitigate various types of acute kidney injury (AKI) in animal models [1–3]. Additionally, our previous research suggests that DPP-4 inhibitors may reduce cisplatin-induced AKI in humans [4]. However, the precise mechanisms underlying their renoprotective effects remain unclear. Recent studies have indicated that DPP-4 inhibition can prevent ferroptosis—an iron-dependent form of cell death—in experimental colon cancer cell lines [5]. Given that AKI primarily results from tubular cell death, we hypothesized that DPP-4 inhibitors may alleviate AKI by preventing tubular ferroptosis.”\n \n \n \n We investigated the renoprotective effects of DPP-4 inhibitors by orally administering teneligliptin (TG), a DPP-4 inhibitor, to mice and inducing AKI using folic acid and glycerol, which are established models where ferroptosis has been reported to play a role [6, 7]. In vitro experiments were conducted using human tubular epithelial cells (HK-2). Cell death was induced using erastin, a known ferroptosis inducer, as well as folic acid and myoglobin, to correspond with the animal experiments. To determine whether folic acid- and myoglobin-induced cell death is ferroptosis-dependent, we employed a ferroptosis inhibitor (Fer-1), an apoptosis inhibitor (z-VAD), and a necroptosis inhibitor (Nec-1s). Cell viability was assessed using the MTT assay and calcein/PI staining.\n \n \n \n In animal studies, TG attenuated both folic acid-induced [Fig. 1A and B] and rhabdomyolysis-induced [Fig. 1C and D] AKI. In vitro, TG reduced folic acid- and myoglobin-induced cell death in HK-2 cells. The ferroptosis inhibitor Fer-1 effectively inhibited folic acid- and myoglobin-induced cell death [Fig. 2A and B], whereas the apoptosis inhibitor z-VAD and the necroptosis inhibitor Nec-1s had no significant effect. Furthermore, TG inhibited erastin-induced cell death [Fig. 2C], indicating that its renoprotective effects are likely mediated through an anti-ferroptotic mechanism in tubular cells.\n \n \n \n Our study demonstrates that the DPP-4 inhibitor TG provides renoprotective effects against folic acid- and rhabdomyolysis-induced AKI by inhibiting ferroptosis in renal tubular cells. The findings suggest that TG reduces tubular cell death by specifically targeting ferroptotic pathways, as evidenced by its effectiveness in suppressing erastin-induced cell death and the lack of effect from apoptosis and necroptosis inhibitors. These results highlight the potential of TG as a therapeutic option for AKI by modulating ferroptosis-related mechanisms.\n","heading_context":"Abstract","domain":"doi.org","title":"#2099 Teneligliptin alleviates acute kidney injury by exerting anti-ferroptotic effects on renal tubules","url":"https://doi.org/10.1093/ndt/gfaf116.0948"},
{"id":"frag_92019f5f","text_content":"Background. Ramadan is the sacred month of the Islamic Hijri (lunar) calendar, and during this entire month, healthy adult Muslims abstain from eating and drinking from dawn to sunset. Muslims with Type 2 Diabetes Mellitus (T2DM) who choose to fast during Ramadan encounter major risks such as hypoglycemia, hyperglycemia, diabetic ketoacidosis, dehydration, and thrombosis. Although patients with poor glycemic control and on multiple insulin injections are at high risk and exempt from fasting, many still insist on it. Thus, healthcare professionals play a pivotal role in managing diabetes-related complications in patients who fast during Ramadan. However, there is a lack of standard guidelines to be followed in association with structured education and administration of drugs and dosage. Therefore, we performed a systematic review and meta-analysis of the literature to determine the safety and efficacy of different classes of drugs and the importance of structured education during Ramadan. Methods. In this review, an extensive PubMed search was performed to obtain literature on T2DM patients who fast during the month of Ramadan until the year 2020. Preference was given to fully downloadable articles. The articles were extracted based on the eligibility criteria. The extracted data were analyzed using Review Manager software version 5.3. Results. A total of 32 articles were included for the review and 7 studies for meta-analysis. Majority of the studies demonstrated the importance of structured education either as a group session or as a one-on-one session with the healthcare professionals in preventing diabetes-related risks during Ramadan. As far as glucose-lowering drugs are concerned, DPP-4 inhibitor combined with metformin remains the drug of choice for T2DM patients who fast during Ramadan. The newer class of glucose-lowering agents appear to lower the risk of hypoglycemia in comparison with sulphonylureas, while among sulphonylureas gliclazide is relatively safe. The meta-analysis indicates that DPP-4 inhibitors would significantly reduce the risk of hypoglycemia as compared to sulphonylurea ( <a:math xmlns:a=\"http://www.w3.org/1998/Math/MathML\" id=\"M1\"><a:mtext>odds</a:mtext><a:mtext> </a:mtext><a:mtext>ratio</a:mtext><a:mo>=</a:mo><a:mn>0.38</a:mn></a:math> , 95% CI: 0.26 to 0.55, <c:math xmlns:c=\"http://www.w3.org/1998/Math/MathML\" id=\"M2\"><c:mi>p</c:mi><c:mo>&lt;</c:mo><c:mn>0.00001</c:mn></c:math> ). Conclusion. The results of our systematic review show that structured education and counselling by healthcare professionals can be an effective tool in preventing complications associated with fasting during Ramadan in people with T2DM. Additionally, the safest class of oral glucose-lowering drugs preferred during Ramadan fasting in T2DM patients is DPP-4 inhibitors.","heading_context":"Abstract","domain":"downloads.hindawi.com","title":"Safety Assessment of Glucose-Lowering Drugs and Importance of Structured Education during Ramadan: A Systematic Review and Meta-Analysis","url":"https://downloads.hindawi.com/journals/jdr/2022/3846253.pdf"},
{"id":"frag_977ae36e","text_content":"PURPOSE\nIn pharmacoepidemiologic studies, estimating medication adherence, persistence, and exposure patterns is critical. Constructing medication treatment episodes from prescription claims data involves assumptions related to grace period, carry-over, and lag effect, but there are no guidelines for these assumptions. We evaluated reporting and variability of these parameters in pharmacoepidemiology studies, using a case study of antihyperglycemic medications and major adverse cardiovascular events (MACE).\n\n\nMETHODS\nWe conducted a systemic review using MEDLINE and EMBASE for studies published prior to January 2, 2020 comparing the risk of MACE between dipeptidyl peptidase 4 (DPP-4) inhibitors and active comparators. We extracted study characteristics and results, including grace period, carry-over, and lag effect. Risk of bias was assessed by the Newcastle-Ottawa scale, and assessments for prevalent user, immortal time, time lag, and time window biases.\n\n\nRESULTS\nA total of 14/1850 studies identified were included. Grace period was not reported in 5 (35.7%) studies and ranged from 0 days to 180 days when reported. Carry-over was not reported in 10 studies (71.4%). Lag effect was not reported in nine (71.4%) studies and ranged from 0 days to 180 days when reported. No studies conducted sensitivity analyses examining the effects of these assumptions on study findings. Predominant biases were inadequate follow-up time, comparability of cohorts, prevalent use, and lag time bias.\n\n\nCONCLUSIONS\nUse of grace period, carry-over, and lag effect were poorly reported and highly variable. Future pharmacoepidemiology studies should improve reporting, justify ranges for these parameters, and conduct sensitivity analyses to evaluate effects of these assumptions.","heading_context":"Abstract","domain":"doi.org","title":"Reporting and variability of constructing medication treatment episodes in pharmacoepidemiology studies: A methodologic systematic review using the case study of DPP-4 inhibitors and cardiovascular outcomes.","url":"https://doi.org/10.1002/pds.5071"},
{"id":"frag_a1998c2c","text_content":"Background The management of type 2 diabetes mellitus (T2DM) in elderly population poses many challenges. Dipeptidyl peptidase-4 (DPP-4) inhibitors show particular promise due to excellent tolerability profiles, low risk of hypoglycemia, and little effect on body weight. This study evaluated, from the health care system’s perspective, the long-term cost-effectiveness of DPP-4 inhibitor monotherapy vs metformin and sulfonylurea (SFU) monotherapy in Thai elderly T2DM patients. Methods The clinical efficacy was estimated from a systematic review and meta-analysis. Baseline cohort characteristics and cost parameters were obtained from published studies and hospital databases in Thailand. A validated IMS CORE Diabetes Model version 8.5 was used to project clinical and economic outcomes over a lifetime horizon using a 3% annual discount rate. Costs were expressed in 2014 Thai Baht (THB) (US dollar value). Incremental cost-effectiveness ratios were calculated. Base-case assumptions were assessed through several sensitivity analyses. Results For treating elderly T2DM patients, DPP-4 inhibitors were more expensive and less effective, ie, a dominated strategy, than the metformin monotherapy. Compared with SFU, treatment with DPP-4 inhibitors gained 0.031 more quality-adjusted life years (QALYs) at a total cost incurred over THB113,701 or US$3,449.67, resulting in an incremental cost-effectiveness ratio of THB3.63 million or US$110,133.50 per QALY. At the acceptable Thai ceiling threshold of THB160,000/QALY (US$4,854.37/QALY), DPP-4 inhibitors were not a cost-effective treatment. Conclusion DPP-4 inhibitor monotherapy is not a cost-effective treatment for elderly T2DM patients compared with metformin monotherapy and SFU monotherapy, given current resource constraints in Thailand.","heading_context":"Abstract","domain":"doi.org","title":"Cost-effectiveness of dipeptidyl peptidase-4 inhibitor monotherapy in elderly type 2 diabetes patients in Thailand","url":"https://doi.org/10.2147/ceor.s113559"},
{"id":"frag_a6aa862a","text_content":"The coexistence of type 2 diabetes mellitus (T2DM) and heart failure (HF), either with reduced (HFrEF) or preserved ejection fraction (HFpEF), is frequent (30–40% of patients) and associated with a higher risk of HF hospitalization, all‐cause and cardiovascular (CV) mortality. The most important causes of HF in T2DM are coronary artery disease, arterial hypertension and a direct detrimental effect of T2DM on the myocardium. T2DM is often unrecognized in HF patients, and vice versa, which emphasizes the importance of an active search for both disorders in the clinical practice. There are no specific limitations to HF treatment in T2DM. Subanalyses of trials addressing HF treatment in the general population have shown that all HF therapies are similarly effective regardless of T2DM. Concerning T2DM treatment in HF patients, most guidelines currently recommend metformin as the first‐line choice. Sulphonylureas and insulin have been the traditional second‐ and third‐line therapies although their safety in HF is equivocal. Neither glucagon‐like preptide‐1 (GLP‐1) receptor agonists, nor dipeptidyl peptidase‐4 (DPP4) inhibitors reduce the risk for HF hospitalization. Indeed, a DPP4 inhibitor, saxagliptin, has been associated with a higher risk of HF hospitalization. Thiazolidinediones (pioglitazone and rosiglitazone) are contraindicated in patients with (or at risk of) HF. In recent trials, sodium–glucose co‐transporter‐2 (SGLT2) inhibitors, empagliflozin and canagliflozin, have both shown a significant reduction in HF hospitalization in patients with established CV disease or at risk of CV disease. Several ongoing trials should provide an insight into the effectiveness of SGLT2 inhibitors in patients with HFrEF and HFpEF in the absence of T2DM.","heading_context":"Abstract","domain":"onlinelibrary.wiley.com","title":"Type 2 diabetes mellitus and heart failure: a position statement from the Heart Failure Association of the European Society of Cardiology","url":"https://onlinelibrary.wiley.com/doi/pdfdirect/10.1002/ejhf.1170"},
{"id":"frag_a6b0fc19","text_content":"Other adverse reaction research Below is a list of other recently published drug safety-related scientific literature. • Adams KK, et al. Re-evaluating aztreonam and ceftazidime hypersensitivity: fraternal not identical twins Journal of Antimicrobial Chemotherapy : 30 Jun 2021. Available from: URL: http://doi.org/10.1093/jac/dkab230 • Baldolli A, et al. Tolerance of BNT162b2 mRNA COVI-19 vaccine in patients with a medical history of COVID-19 disease: A case control study Vaccine : 23 Jun 2021. Available from: URL: http://doi.org/10.1016/ j.vaccine.2021.06.054 • Furuya-Kanamori L, et al. Comparison of immunogenicity and safety of licensed Japanese encephalitis vaccines: A systematic review and network meta-analysis Vaccine : 23 Jun 2021. Available from: URL: http://doi.org/10.1016/ j.vaccine.2021.06.023 • Lin DS, et al. Major adverse cardiovascular and limb events in patients with diabetes treated with GLP-1 receptor agonists vs DPP-4 inhibitors Diabetologia : 30 Jun 2021. Available from: URL: http://doi.org/10.1007/ s00125-021-05497-1 • Petrelli F, et al. Risk of Infection with Immune Checkpoint Inhibitors: A Systematic Review and Meta-analysis Targeted Oncology : 7 Jul 2021. Available from: URL: https://doi.org/10.1007/s11523-021-00824-3 • Rubio-Infante N, et al. Cardiotoxicity associated with immune checkpoint inhibitors therapy: A meta-analysis European Journal of Heart Failure : Jul 2021. Available from: URL: http://doi.org/10.1002/ejhf.2289 • Scailteux L-M, et al. Hospitalization for adverse events under abiraterone or enzalutamide exposure in real-world setting: a French population-based study on prostate cancer patients British Journal of Clinical Pharmacology : 7 Jul 2021. Available from: URL: http://doi.org/10.1111/bcp.14972 • Young LA, et al. Ocular adverse events in PD-1 and PD-L1 inhibitors Journal for ImmunoTherapy of Cancer : 7 Jul 2021. Available from: URL: http://doi.org/10.1136/jitc-2020-002119","heading_context":"Abstract","domain":"www.ncbi.nlm.nih.gov","title":"Other adverse reaction research","url":"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8271297"},
{"id":"frag_a6bde10f","text_content":"\n \n \n Dipeptidyl peptidase-4 (DPP-4) inhibitor could attenuate cisplatin nephrotoxicity dependent on the glucagon-like peptide-1 (GLP-1) signaling pathway [1]. We had previously reported that the use of a DPP-4 inhibitor might also attenuate cisplatin nephrotoxicity in diabetic cancer patients [2], and its renoprotective effect was lost under magnesium (Mg) deficiency [3]. However, it remains to be investigated how the GLP-1 signaling pathway changes after the treatment of a DPP-4 inhibitor under Mg deficiency. The purpose of this study was to examine the changes in the downstream pathway of the GLP-1 signaling pathway after the treatment of DPP-4 inhibitor under Mg deficiency.\n \n \n \n Sprague Dawley rats received a Mg-deficient diet for 7 days to induce Mg deficiency (low Mg group). Control diet was given to the normal Mg group. Oral administration of a DPP-4 inhibitor was injected 1 day before sacrifice. The changes in serum active GLP-1, insulin, insulin-like growth factor (IGF-1), and the expression of their receptor in the kidney were examined. In addition, the phosphorylation of insulin/IGF-1 receptors in the kidney were investigated.\n \n \n \n Serum active GLP-1 increased equally in both groups with DPP-4 inhibitor administration. Renal GLP-1 receptor expression was not observed in the renal tubules. Serum IGF-1 did not change with DPP-4 inhibitor administration in the normal Mg group but increased in the low Mg group. In normal Mg group, renal IGF-1 receptor expression tended to increase with DPP-4 inhibitor administration, and its phosphorylation increased significantly. In contrast, the expression and phosphorylation of the IGF-1 receptor did not change with DPP-4 inhibitor administration in the low Mg group. The increase in serum insulin with the DPP-4 inhibitor was enhanced in the low Mg group, compared to the normal Mg group. The expression and phosphorylation of the insulin receptor did not change with DPP-4 inhibitor administration in both groups.\n \n \n \n DPP-4 inhibitor activated the renal IGF-1 signaling pathway, but this effect disappeared under Mg deficiency. Further investigation is needed to determine whether the renal protective effect of DPP-4 inhibitor is dependent on the IGF-1 signaling pathway.\n","heading_context":"Abstract","domain":"academic.oup.com","title":"#411 Magnesium deficiency abrogates the activation of Insulin-like growth factor-1 signaling pathway in the kidney induced by DPP4 inhibitor","url":"https://academic.oup.com/ndt/article-pdf/39/Supplement_1/gfae069-1107-411/57792054/gfae069-1107-411.pdf"},
{"id":"frag_a96b925e","text_content":"Glucagon-like peptide-1 receptor agonists and dipeptidyl peptidase-4 inhibitors are commonly used treatments for patients with type 2 diabetes mellitus (T2DM). Both anti-diabetic treatments function by playing key modulatory roles in the incretin system. Though these drugs have been deemed effective in treating T2DM, the Food and Drug Administration (FDA) and some members of the scientific community have questioned the safety of these therapeutics relative to important cardiovascular endpoints. As a result, since 2008, the FDA has required all new drugs for glycemic control in T2DM patients to demonstrate cardiovascular safety. The present review article strives to assess the safety and benefits of incretin-based therapy, a new class of antidiabetic drug, on the health of patient cardiovascular systems. In the process, this review will also provide a physiological overview of the incretin system and how key components function in T2DM.","heading_context":"Abstract","domain":"mmrjournal.biomedcentral.com","title":"DPP-4 inhibitors and GLP-1RAs: cardiovascular safety and benefits","url":"https://mmrjournal.biomedcentral.com/counter/pdf/10.1186/s40779-022-00410-2"},
{"id":"frag_ad910f79","text_content":"Question In type 2 diabetes, what is the relative effectiveness of dipeptidyl peptidase 4 (DPP-4) inhibitors, glucagon-like peptide 1 (GLP-1) agonists, and sodiumglucose cotransporter 2 (SGLT-2) inhibitors for reducing mortality and cardiovascular (CV) events? Review scope Included studies compared DPP-4 inhibitors, GLP-1 agonists, or SGLT-2 inhibitors at market-approved doses with control (placebo or no treatment) or each other in patients with type 2 diabetes mellitus, had follow-up 12 weeks, and reported 1 outcome of interest. Outcomes included all-cause mortality (primary), CV mortality, heart failure (HF), myocardial infarction (MI), stroke, and hypoglycemia. Review methods MEDLINE, EMBASE/Excerpta Medica, and Cochrane Central Register of Controlled Trials to Oct 2017, and reference lists were searched for English-language randomized controlled trials (RCTs). 236 RCTs (n =176310; mean age 53 y and 51% men in DPP-4 inhibitor vs GLP-1 agonist comparisons to mean age 58 y and 58% men in SGLT-2 inhibitor vs control comparisons) with 258 comparisons met inclusion criteria, including 9 CV outcome RCTs (n =87162). 104 RCTs had low risk for bias in all domains (Cochrane risk-of-bias tool). Main results Results of network meta-analysis for all-cause mortality, HF, and MI are in the Table. Results for CV mortality were consistent with those for all-cause mortality, and drugs did not differ from control or each other for any stroke or major hypoglycemia (data not shown). Conclusion In type 2 diabetes, sodiumglucose cotransporter 2 inhibitors or glucagon-like peptide 1 agonists reduce mortality more than placebo, no treatment, or dipeptidyl peptidase 4 inhibitors. Network meta-analysis of DPP-4is, GLP-1as, and SGLT-2is vs control (placebo or no treatment) or each other in patients with type 2 diabetes* Outcomes Drug vs control HR (95% CrI) NNT (CrI) All-cause mortality DPP-4i 1.02 (0.94 to 1.11) NS GLP-1a 0.88 (0.81 to 0.94) 167 (100 to 334) SGLT-2i 0.80 (0.71 to 0.89) 100 (67 to 167) Heart failure DPP-4i 1.13 (1.00 to 1.28) NS GLP-1a 0.93 (0.84 to 1.02) NS SGLT-2i 0.62 (0.54 to 0.72) 91 (77 to 125) Myocardial infarction DPP-4i 0.94 (0.88 to 1.01) NS GLP-1a 0.94 (0.87 to 1.02) NS SGLT-2i 0.86 (0.77 to 0.97) 167 (112 to 1000) Drug vs drug All-cause mortality GLP-1a vs DPP-4i 0.86 (0.77 to 0.96) 200 (112 to 500) SGLT-2i vs DPP-4i 0.78 (0.68 to 0.90) 112 (84 to 250) SGLT-2i vs GLP-1a 0.91 (0.79 to 1.04) NS Heart failure GLP-1a vs DPP-4i 0.82 (0.70 to 0.95) 250 (143 to 1000) SGLT-2i vs DPP-4i 0.55 (0.46 to 0.67) 91 (77 to 125) SGLT-2i vs GLP-1a 0.67 (0.57 to 0.80) 112 (84 to 200) Myocardial infarction GLP-1a vs DPP-4i 1.00 (0.90 to 1.11) NS SGLT-2i vs DPP-4i 0.91 (0.80 to 1.04) NS SGLT-2i vs GLP-1a 0.92 (0.80 to 1.05) NS *CrI = credible interval; DPP-4i = dipeptidyl peptidase 4 inhibitor; GLP-1a = glucagon-like peptide 1 agonist; HR = hazard ratio; NS = not significant; SGLT-2i = sodiumglucose cotransporter 2 inhibitor; other abbreviations defined in Glossary. NNT and CrI calculated from absolute risk differences and CrIs in article using a fixed-effect model. The network meta-analysis includes direct and indirect comparisons. Results for direct comparisons were consistent with indirect comparisons unless otherwise stated. 97 trials contributed data to the all-cause mortality and myocardial infarction analyses and 58 to the heart failure analysis. HR <1 indicates benefit for the first comparator; HR >1 indicates benefit for the second comparator. Direct comparison HR 3.23, CrI 0.70 to 24.7, vs indirect comparison HR 0.81, CrI 0.69 to 0.94, P =0.03 for interaction. Commentary The paucity of trials directly comparing the efficacy of SGLT-2 inhibitors, GLP-1 agonists, and DPP-4 inhibitors led Zheng and colleagues to explore the network of pertinent evidence. They found that SGLT-2 inhibitors and GLP-1 agonists prevented more deaths and episodes of HF than DPP-4 inhibitors. These differences relied mainly on results of indirect comparisons calculated using network meta-analysis, although results for direct and indirect comparisons were largely consistent. The review could not explore differences between drugs of the same class. For example, although SGLT-2 inhibitors as a class did not increase risk for lower limb amputations, trials of specific agents yielded inconsistent results. This includes 2 large trials that found an increased risk for amputations with canagliflozin (1). Similar to results in patients with type 2 diabetes (2), the systematic review and meta-analysis by Yamada and colleagues found that adding SGLT-2 inhibitors to insulin in patients with type 1 diabetes reduced HbA1c (by 0.4%), blood pressure, and body weight. Use of these agents also increased risks for diabetic ketoacidosis (DKA) and genital tract infection. DKA may occur in patients using SGLT-2 inhibitors because lowering glycemia through an insulin-independent mechanism increases the glucagon-to-insulin ratio, resulting in elevated rates of lipolysis, hepatic ketogenesis, and an increased tendency toward DKA, especially in the setting of a precipitant (3). Taken together, the body of evidence continues to favor GLP-1 agonists and, particularly, SGLT-2 inhibitors for their ability to reduce CV and renal events (1, 4) in patients with type 2 diabetes; the potential benefits in patients with type 1 diabetes remain speculative. The favorable effects of SGLT-2 inhibitors on weight, glycemia, and CV risk without severe hypoglycemia in patients with type 2 diabetes must be contrasted with the unfavorable onesgenitourinary infections; DKA; and, in the case of canagliflozin, amputations. Clinicians and their patients can use the results of the review by Zheng and colleagues to develop a preference for which drug to considerincluding SGLT-2 inhibitors or GLP-1 agonistswhen further glycemic control is needed for type 2 diabetes. In patients with type 1 diabetes, the role of SGLT-2 inhibitors in improving care and outcomes are uncertain.","heading_context":"Abstract","domain":"doi.org","title":"Review: In type 2 diabetes, SGLT-2 inhibitors or GLP-1 agonists reduce mortality vs control or DPP-4 inhibitors","url":"https://doi.org/10.7326/ACPJC-2018-169-2-002"},
{"id":"frag_b7d20988","text_content":"BackgroundIncretin-based agents, including dipeptidyl peptidase-4 inhibitors (DPP-4Is) and glucagon-like peptide-1 agonists (GLP-1As), work via GLP-1 receptor for hyperglycemic control directly or indirectly, but have different effect on cardiovascular (CV) outcomes. The present study is to evaluate and compare effects of incretin-based agents on CV and pancreatic outcomes in patients with type 2 diabetes mellitus (T2DM) and high CV risk.MethodsSix prospective randomized controlled trials (EXMAINE, SAVOR-TIMI53, TECOS, ELIXA, LEADER and SUSTAIN-6), which included three trials for DPP-4Is and three trials for GLP-1As, with 55,248 participants were selected to assess the effect of different categories of incretin-based agents on death, CV outcomes (CV mortality, major adverse CV events, nonfatal myocardial infarction, nonfatal stroke, heart failure hospitalization), pancreatic events (acute pancreatitis and pancreatic cancer) as well as on hypoglycemia.ResultsWhen we evaluated the combined effect of six trials, the results suggested that incretin-based treatment had no significant effect on overall risks of CV and pancreatic outcomes compared with placebo. However, GLP-1As reduced all-cause death (RR = 0.90, 95% CI 0.82–0.98) and CV mortality (RR = 0.84, 95% CI 0.73–0.97), whereas DPP-4Is had no significant effect on CV outcomes but elevated the risk for acute pancreatitis (OR = 1.76, 95% CI 1.14–2.72) and hypoglycemia (both any and severe hypoglycemia), while GLP-1As lowered the risk of severe hypoglycemia.ConclusionsGLP-1As decreased risks of all-cause and CV mortality and severe hypoglycemia, whereas DPP-4Is had no effect on CV outcomes but increased risks in acute pancreatitis and hypoglycemia.","heading_context":"Abstract","domain":"cardiab.biomedcentral.com","title":"Incretin-based agents in type 2 diabetic patients at cardiovascular risk: compare the effect of GLP-1 agonists and DPP-4 inhibitors on cardiovascular and pancreatic outcomes","url":"https://cardiab.biomedcentral.com/track/pdf/10.1186/s12933-017-0512-z"},
{"id":"frag_b92a8f41","text_content":"Background: The objective was to evaluate the efficacy of the combination of Glucagon-like peptide-1 receptor agonists (GLP-1 RAs), dipeptidyl peptidase-4 inhibitors (DPP-4i), and sodium-glucose cotransporter 2 inhibitor (SGLT-2i) in the treatment of Type 2 diabetes with poor efficacy of basic insulin and metformin/sulfonylurea by umbrella review. Materials and Methods: Forming the data of publication of each database through 13 September 2022, PubMed, EMBASE, and Cochrane Library were surveyed. Results: A total of seven meta-analyses were included in the umbrella review. The combination of GLP-1 RA (WMD −3.41 [−5.61, −1.21], p = 0.002), SGLT-2i (WMD −5.34 [−9.56, −1.13], p = 0.013), and DPP-4i (WMD −5.56 [−7.39, −3.73], p ≤ 0.001) can significantly reduce HbA1c levels, respectively. The combination of GLP-1 RA (WMD −1.55 [−2.92, −0.18], p = 0.027), SGLT-2i (WMD −2.96 [−6.68, 0.77], p = 0.12), and DPP-4i (WMD −2.05 [−2.82, −1.28], p ≤ 0.001) can significantly reduce fasting plasma glucose (FPG) levels, respectively. The combination of GLP-1 RA (WMD −3.24 [−5.14, −1.34], p < 0.001) can significantly reduce body weight of Type 2 diabetes mellitus (T2DM). The dose of basic insulin in diabetes patients after combined use of GLP-1 RA (WMD −2.74 [−4.26, −1.22], p ≤ 0.001) was significantly reduced. The combination use of GLP-1 RAs (OR 1.28 [1.05, 1.56], p = 0.017) increases the risk of hypoglycemia. Conclusions: The combination of GLP-1 RAs, DPP-4i, and SGLT-2i can effectively lower HbA1c and FPG in T2DM patients who have poor therapeutic effects on basic insulin combined with metformin/sulfonylureas, respectively. Compared to placebo, GLP-1 RAs can significantly reduce body weight and basic insulin dosage, while DPP-4i and SGLT-2i have a lower risk of hypoglycemia. Trial Registration: CRD42023410345.","heading_context":"Abstract","domain":"doi.org","title":"Comparison of GLP-1 Receptor Agonists, SGLT-2 Inhibitors, and DPP-4 Inhibitors as an Add-On Drug to Insulin Combined With Oral Hypoglycemic Drugs: Umbrella Review","url":"https://doi.org/10.1155/2024/8145388"},
{"id":"frag_c37c8ba8","text_content":"Of 2236 abstracts identified through a systematic literature review, 30 RCTs published between 2003 and 2013 were included. RCTs ranged from 12 to 52 weeks in duration, included 28 to 1274 patients, were of parallel design, and most were open-label. Comparators included placebo (reference treatment), SGLT2 inhibitors, dipeptidyl peptidase-4 (DPP-4) inhibitors, thiazolidinediones (TZDs), alpha-glucosidase inhibitors (AGIs), meglitinides, glucagon-like peptide 1 (GLP-1) analogues, and basal, bolus, and biphasic insulin, all added on to MET + SU, as well as basal and biphasic insulin added to MET and monotherapy. The mean change (%) in HbA1c levels compared to placebo was -0.86 for SGLT2 inhibitors, -0.68 for DPP-4 inhibitors, -0.93 for TZDs, and -1.07 for GLP-1 analogues, respectively. Only SGLT2 inhibitors and GLP-1 analogues led to a weight loss (-1.71 kg and -1.14 kg, respectively) and decrease in systolic blood pressure (SBP; -3.73 mmHg and -2.90 mmHg, respectively), while all other treatments showed either an increase or no changes in weight or SBP. Conclusion SGLT2 inhibitors are at least as effective as other classes of antidiabetic agents at controlling HbA1c levels, while providing the additional benefits of weight loss and reducing SBP. Additionally, since the risk of hypoglycemia is similar or reduced with SGLT2 inhibitors, patients do not have to trade off efficacy for tolerability. Similar findings were observed for GLP-1 analogues.","heading_context":"Abstract","domain":"doi.org","title":"Network meta-analysis of treatments for type 2 diabetes mellitus following failure with metformin plus sulfonylurea","url":"https://doi.org/10.1185/03007995.2015.1135110"},
{"id":"frag_c49a1650","text_content":"Purpose Achieving good glycemic control in type 2 diabetes (T2DM) may require individualized pharmacological approaches. We aimed to compare direct healthcare costs in patients treated with empagliflozin (EMPA) compared to dipeptidyl peptidase-4 inhibitors (DPP-4i) or glucagon-like peptide-1 receptor agonists (GLP-1-RA). Patients and Methods This German claims data study included continuously insured persons with at least two outpatient diagnoses and/or one inpatient diagnosis of T2DM if they started EMPA, DPP-4i, or GLP-1-RA in 2015–2018. Healthcare costs were assessed from therapy initiation until the end of data availability, death, or therapy discontinuation and compared among propensity score-matched cohorts. Results Of 24,465 patients included, 3285 received EMPA, 19,443 DPP-4i, and 1747 GLP-1-RA. Matched cohorts were balanced on baseline characteristics (EMPA versus DPP-4i: n1/n2 = 3100/3100 and EMPA versus GLP-1-RA: n3/n4 = 1346/1346). Mean total costs after start of DPP-4i were €7009 (95%-CI: 6573–7444) versus €4274 (3982–4566) for EMPA. Costs associated with GLP-1-RA treatment were also significantly higher compared with EMPA (€6851 [6183–7518] versus €4895 [4345–5445]). Conclusion Although the individual clinical patient profile and physician assessment are paramount in treatment decisions, substantial differences in the economic impact of different antidiabetic therapies should be considered.","heading_context":"Abstract","domain":"www.dovepress.com","title":"Healthcare Resource Utilization and Associated Costs in New Users of Empagliflozin versus DPP-4 Inhibitors and GLP-1 Agonists: A Comparative Analysis Based on Retrospective Real-World Data from German Sickness Funds","url":"https://www.dovepress.com/getfile.php?fileID=80438"},
{"id":"frag_c7b9f4cc","text_content":"Objective Several oral antidiabetic regimens are available for treating type 2 diabetes mellitus (T2DM), dipeptidyl peptidase-4 inhibitors (DPP4i) being one of them. We conducted a network meta-analysis (NMA) comparing DPP4i plus metformin (Met) combination with other Met-based oral antidiabetic drug (OAD) combinations used in treating patients with T2DM. Methods We searched PubMed and Embase from inception until 19th April, 2022 for phase II and phase III trials in patients with T2DM on Met-based traditional OADs. The primary outcome was assessed by change in glycated hemoglobin (HbA1c), fasting plasma glucose (FPG), and 2-hour post-prandial blood glucose (2h-PPG). The secondary safety outcomes assessed were hypoglycemic events, serious adverse events (SAEs), cardiovascular (CV) events, and gastrointestinal (GI) events. Results Sixty-two trials were included in the analysis. The combination of DPP4i + Met revealed a comparable mean reduction in HbA1c levels to the glinides (Gli) + Met combination (mean difference [MD]: −0.03%, 95% CI: 0.69, −0.65), although the difference was not statistically significant. The mean HbA1c reduction with DPP4i + Met was greater than with sulfonylureas (SU) + Met (MD: −0.05, 95% CI: −0.29, 0.39), thiazolidinedione (TZD) + Met (MD: −0.69, 95% CI: −1.39, −0.02), and SU + TZD (MD: 0.21; 95% CI: −1.30, 1.71), with no statistical significance. DPP4i + Met demonstrated a non-significant lower incidence of CV events in comparison to TZD + Met (RR: 1.01, 95% CI: 0.46, 2.45) and SU + Met (RR: 1.06, 95% CI: 0.61, 2.06). Conclusion DPP4i in combination with Met was efficacious and had a well-tolerated safety profile compared with other traditional OADs. This combination can be considered as a suitable treatment option for patients with T2DM.","heading_context":"Abstract","domain":"www.dovepress.com","title":"Efficacy and Safety of DPP-4 Inhibitors and Metformin Combinations in Type 2 Diabetes: A Systematic Literature Review and Network Meta-Analysis","url":"https://www.dovepress.com/getfile.php?fileID=100101"},
{"id":"frag_c8888a29","text_content":"Objective To compare the cardiovascular and renal outcomes of GLP-1 RA versus DPP4i and basal insulin in the management of T2DM. Methods Data from 22 studies involving over 200,000 participants were pooled using the inverse variance method and random-effects meta-analysis. The review was reported in accordance with PRISMA. Results Compared with DPP4i, treatment with GLP-1 RA was associated with a greater benefit on composite cardiovascular outcomes (HR:0.77, 95% CI:0.69–0.87), myocardial infarction (HR:0.82, 95% CI:0.69–0.97), stroke (HR:0.83, 95% CI: 0.74–0.93), cardiovascular mortality (HR:0.76, 95% CI:0.68–0.85) and all-cause mortality (HR:0.65, 95% CI:0.48–0.90). There was no difference in effect on heart failure (HR:0.97, 95% CI:0.82–1.15). Compared with basal insulin, GLP-1 RA was associated with better effects on composite cardiovascular outcomes (HR:0.62, 95% CI:0.48–0.79), heart failure (HR:0.57, 95% CI:0.35–0.92), myocardial infarction (HR:0.70, 95% CI:0.58–0.85), stroke (HR:0.50, 95% CI:0.40–0.63) and all-cause mortality (HR:0.31, 95% CI:0.20–0.48). Evidence from a small number of studies suggests that GLP-1 RA had better effects on composite and individual renal outcomes, such as eGFR, compared with either DPP4i and basal insulin. Conclusion Available evidence suggests that treating T2DM with GLP-1 RA can yield better benefits on composite and specific cardiorenal outcomes than with DPP4i and basal insulin. PROSPERO Registration Number CRD42022335504.","heading_context":"Abstract","domain":"journals.sagepub.com","title":"Cardiovascular and renal outcomes of GLP-1 receptor agonists vs. DPP-4 inhibitors and basal insulin in type 2 diabetes mellitus: A systematic review and meta-analysis","url":"https://journals.sagepub.com/doi/pdf/10.1177/14791641231221740"},
{"id":"frag_ca56d0f2","text_content":"AClear evidence from well-conducted, generalizable RCTs that are adequately powered, including: c Evidence from a well-conducted multicenter trial c Evidence from a meta-analysis that incorporated quality ratings in the analysis Compelling nonexperimental evidence, i.e., \"all or none\" rule developed by the Centre for Evidence-Based Medicine at the University of Oxford Supportive evidence from well-conducted RCTs that are adequately powered, including:c Evidence from a well-conducted trial at one or more institutions c Evidence from a meta-analysis that incorporated quality ratings in the analysis B Supportive evidence from well-conducted cohort studies c Evidence from a well-conducted prospective cohort study or registry c Evidence from a well-conducted meta-analysis of cohort studies Supportive evidence from a well-conducted case-control study C Supportive evidence from poorly controlled or uncontrolled studies c Evidence from randomized clinical trials with one or more major or three or more minor methodological flaws that could invalidate the results c Evidence from observational studies with high potential for bias (such as case series with comparison with historical controls) c Evidence from case series or case reports Conflicting evidence with the weight of evidence supporting the recommendation E Expert consensus or clinical experience S12","heading_context":"Abstract","domain":"care.diabetesjournals.org","title":"Standards of Medical Care in Diabetes—2013","url":"https://care.diabetesjournals.org/content/diacare/36/Supplement_1/S11.full.pdf"},
{"id":"frag_cca2ede3","text_content":"Objective To perform a systematic review and meta-analysis regarding the efficacy and safety of dipeptidyl peptidase-4 (DDP-4) inhibitors (“gliptins”) for the treatment of type 2 diabetes mellitus (T2DM) patients with moderate to severe renal impairment. Methods All available randomized-controlled trials (RCTs) that assessed the efficacy and safety of DDP-4 inhibitors compared with placebo, no treatment, or active drugs were identified using PubMed, EMBASE, Cochrane CENTRAL, conference abstracts, clinical trials.gov, pharmaceutical company websites, the FDA, and the EMA (up to June 2014). Two independent reviewers extracted the data, and a random-effects model was applied to estimate summary effects. Results Thirteen reports of ten studies with a total of 1,915 participants were included in the final analysis. Compared with placebo or no treatment, DPP-4 inhibitors reduced HbA1c significantly (−0.52%, 95%CI −0.64 to −0.39) and had no increased risk of hypoglycemia (RR 1.10, 95%CI 0.92 to 1.32) or weight gain. In contrast to glipizide monotherapy, DPP-4 inhibitors showed no difference in HbA1c lowering effect (−0.08%, 95% CI −0.40 to 0.25) but had a lower incidence of hypoglycemia (RR 0.40, 95%CI 0.23 to 0.69). Furthermore, DPP-4 inhibitors were well-tolerated, without any additional mortality and adverse events. However, the quality of evidence was mostly as low, as assessed using the GRADE system for each outcome. Conclusions DPP-4 inhibitors are effective at lowering HbA1c in T2DM patients with moderate to severe renal impairment. DPP-4 inhibitors also have a potential advantage in lowering the risk of adverse events. Regarding the low quality of the evidence according to GRADE, additional well-designed randomized trials that focus on the safety and efficacy of DPP-4 inhibitors in various CKD stages are needed urgently.","heading_context":"Abstract","domain":"journals.plos.org","title":"Efficacy and Safety of Dipeptidyl Peptidase-4 Inhibitors in Type 2 Diabetes Mellitus Patients with Moderate to Severe Renal Impairment: A Systematic Review and Meta-Analysis","url":"https://journals.plos.org/plosone/article/file?id=10.1371/journal.pone.0111543&type=printable"},
{"id":"frag_d09fc722","text_content":"The consensus algorithm for the medical management of type 2 diabetes was published in August 2006 with the expectation that it would be updated, based on the availability of new interventions and new evidence to establish their clinical role. The authors continue to endorse the principles used to develop the algorithm and its major features. We are sensitive to the risks of changing the algorithm cavalierly or too frequently, without compelling new information. An update to the consensus algorithm published in January 2008 specifically addressed safety issues surrounding the thiazolidinediones. In this revision, we focus on the new classes of medications that now have more clinical data and experience.","heading_context":"Abstract","domain":"diabetesjournals.org","title":"Medical Management of Hyperglycemia in Type 2 Diabetes: A Consensus Algorithm for the Initiation and Adjustment of Therapy","url":"https://diabetesjournals.org/care/article-pdf/32/1/193/600128/zdc00109000193.pdf"},
{"id":"frag_da75070c","text_content":"\n \n \n Cisplatin is an effective chemotherapeutic agent, but often induces acute kidney injury (AKI). Magnesium (Mg) deficiency is often found in cancer patients, and the nephrotoxicity of cisplatin is exacerbated under Mg deficiency [1]. We previously reported the potential of Dipeptidyl peptidase-4 (DPP-4) inhibitor to attenuate cisplatin nephrotoxicity in rats and diabetic cancer patients [2, 3]. However, it remains to be investigated whether DPP-4 inhibitor can preserve its renoprotective effect under Mg deficiency. The purpose of this study was to examine whether DPP-4 inhibitor can prevent cisplatin-induced AKI even under Mg deficiency.\n \n \n \n Sprague Dawley rats received Mg-deficient diet for 7days to induce Mg deficiency. AKI was induced in rats by injecting cisplatin intravenously. Oral administration of a DPP-4 inhibitor, once a day, was started 1day before injecting cisplatin. Mg sulfate was once injected intraperitoneally just before injecting cisplatin to correct Mg deficiency (Fig. 1A). By using our previous cohort data [3], we divided diabetic cancer patients treated with high-dose cisplatin (>50 mg/m2)-containing regimens into 4 groups according to the use/unused of Mg sulfate or DPP-4 inhibitor. The change of estimated glomerular filtration rate (eGFR) within 2 weeks after cisplatin treatment was compared between the groups.\n \n \n \n At the peak of AKI (day 5), Mg sulfate supplementation significantly attenuated the increase of blood urea nitrogen (BUN), and combination of Mg sulfate and DPP-4 inhibitor further suppressed the increase of BUN as compared to rats received only cisplatin. However, DPP-4 inhibitor alone did not attenuate the increase of BUN under Mg deficiency (Fig. 1B). The result of serum creatinine (sCr) was consistent with that of BUN (Fig. 1C). This effect was associated with a reduced renal cell death as evaluated with the terminal uridine nick-end labeling (TUNEL)+ cells (Fig. 1D).The change of eGFR was significantly less in the patients treated with both of DPP-4 inhibitors/Mg supplementation, compared to those without DPP-4 inhibitors/Mg supplementation. The effect was not found in patients with either DPP-4 inhibitor alone or Mg supplementation alone as compared to those without DPP-4 inhibitor/Mg supplementation (Fig. 2).\n \n \n \n Our results suggested that Mg deficiency must be corrected to exert the renoprotective effect of DPP-4 inhibitor on cisplatin nephrotoxicity. The molecular mechanisms underlying this phenomenon remain to be defined.\n","heading_context":"Abstract","domain":"academic.oup.com","title":"#2920 MAGNESIUM DEFICIENCY ABROGATES THE RENOPROTECTIVE EFFECT OF DPP-4 INHIBITOR ON CISPLATIN-INDUCED KIDNEY INJURY","url":"https://academic.oup.com/ndt/article-pdf/38/Supplement_1/gfad063c_2920/50673158/gfad063c_2920.pdf"},
{"id":"frag_da90976c","text_content":"Randomized controlled trials (RCTs) have evaluated the efficacy of dipeptidyl peptidase-4 inhibitors (DPP-4i) as add-on therapy to insulin compared to insulin alone in T2DM patients, while there have been differences in the magnitude of the outcome effect across studies. This updated systematic review and meta-analysis aimed to evaluate the effect of DPP-4i in combination with insulin on HbA1c in T2DM patients. MEDLINE, EMBASE, and Cochrane databases were searched for RCTs that compared DPP-4i plus insulin to insulin alone for T2DM patients, with or without background therapy with other oral agents. The primary endpoint was the absolute change of HbA1c from baseline. Weighted mean difference (WMD) with 95% confidence intervals (CI) was calculated using a random effect model. The methodological quality of included RCTs was evaluated using the Cochrane risk of bias tool. Eighteen RCTs involving 6,493 patients with average follow-up of 32 weeks were identified and analyzed. DPP-4i plus insulin showed greater reduction in HbA1c than insulin alone (WMD -0.52%, 95% CI -0.61 to -0.43; P In conclusion, compared with use of insulin alone, DPP-4i in combination with insulin can significantly lower HbA1c levels in T2DM patients. Further analysis is needed to better understand effects of this combination therapy on other outcomes, such as hypoglycemia and insulin. Disclosure J. Yang: None. Q. Tian: None. Y. Tang: Employee; Self; Merck & Co., Inc.. Stock/Shareholder; Self; Merck & Co., Inc.. Employee; Spouse/Partner; GlaxoSmithKline plc.. Stock/Shareholder; Spouse/Partner; GlaxoSmithKline plc. A.K. Shah: Employee; Self; Merck & Co., Inc.. Stock/Shareholder; Self; Merck & Co., Inc. R. Zhang: Employee; Self; Merck Sharp & Dohme Corp. G. Chen: Employee; Self; Merck Sharp & Dohme Corp.. Y. Zhang: None. S. Rajpathak: Employee; Self; Merck & Co., Inc. T. Hong: Advisory Panel; Self; Novo Nordisk A/S, AstraZeneca.","heading_context":"Abstract","domain":"doi.org","title":"Meta-analysis of HbA1c-Lowering Efficacy of Dipeptidyl Peptidase-4 Inhibitors in Combination with Insulin in T2DM Patients","url":"https://doi.org/10.2337/DB18-2302-PUB"},
{"id":"frag_da91751c","text_content":"\n \n \n Dipeptidyl peptidase-4 (DPP-4) inhibitors have been shown to attenuate several types of acute kidney injury (AKI) in animal models [1–3]. However, the mechanisms underlying their renoprotective effects remain to be clarified. Previous studies had identified ferroptosis as the primary cell death pathway for folic acid-induced AKI in mice [4]. Referring to that report, we previously reported that teneligliptin, a DPP-4 inhibitor, ameliorates folic acid-induced AKI. In the present study, we investigated whether teneligliptin attenuates folic acid-induced tubular cell death through its anti-ferroptotic properties.\n \n \n \n In in vitro experiments, we used HK-2 cells, human proximal tubular epithelial cells. HK-2 cells were co-cultured with folic acid and z-VAD-FMK (zVAD), an apoptosis inhibitor; Necrostatin-1s (Nec-1s), a necroptosis inhibitor; Ferrostatin-1 (Fer-1), a ferroptosis inhibitor; or teneligliptin. Co-incubation of erastin, a ferroptosis inducer, and teneligliptin was also performed. The 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide (MTT) assay was conducted on HK-2 cells to assess cell viability.\n \n \n \n Fer-1, but not z-VAD or Nec-1s, inhibited folic acid-induced cell death (Fig. 1A-C), indicating that ferroptosis contributes to folic acid-induced tubular cell death, rather than apoptosis or necroptosis. Teneligliptin also inhibited folic acid- and erastin-induced tubular cell death (Fig. 1D,E), suggesting that the DPP-4 inhibitor inhibits folic acid-induced tubular cell death via its anti-ferroptotic properties.\n \n \n \n DPP-4 inhibitor prevents folic acid-induced tubular cell death by inhibiting ferroptosis in vitro, which may contribute to the attenuation of AKI in vivo.\n","heading_context":"Abstract","domain":"academic.oup.com","title":"#1385 Dipeptidyl-peptidase-4 inhibitor teneligliptin attenuates folic acid-induced tubular cell death via inhibiting ferroptosis","url":"https://academic.oup.com/ndt/article-pdf/39/Supplement_1/gfae069-1102-1385/57792962/gfae069-1102-1385.pdf"},
{"id":"frag_dca17cc7","text_content":"Objective: Despite intensive insulin treatment in patients with type 1 diabetes (T1D), their glycemic levels often do not reach the recommended target goal. We performed a network meta-analysis to evaluate the efficacy and safety of additional therapy to insulin in patients with T1D. Methods: We searched CENTRAL, MEDLINE, and Embase from 1970 until January 2019 to identify randomized controlled trials (RCTs) in T1D patients treated with insulin and oral hypoglycemic agents or glucagon-like peptide-1 receptor agonists. We performed network meta-analyses using Bayesian models and generated rankings of the different hypoglycemic agents by generation mixed treatment comparison. Results: With 23 RCTs (n =3,839), we performed the network meta-analysis using eight groups; 1) insulin alone, 2) insulin and metformin, 3) insulin and canagliflozin, 4) insulin and dapagliflozin, 5) insulin and empagliflozin, 6) insulin and sotagliflozin, 7) insulin and liraglutide, and 8) insulin and exenatide. Compared with insulin alone, HbA1c was significantly lower in the group treated with insulin and sotagliflozin (mean difference: -0.43%; 95% Crl: -0.66, -0.20). Total daily insulin dose was significantly lower in the insulin and sotagliflozin group by 6.4 U/day than other groups. Compared with insulin alone, body weight was decreased in the group with insulin and canagliflozin by 4.5 kg, insulin and sotagliflozin by 2.8 kg, insulin and liraglutide by 4.5kg, and insulin and exenatide by 5.1 kg, respectively. Severe hypoglycemic episodes did not differ between the groups. Conclusions: In patients with T1D, sotagliflozin treatment combined with insulin decreased HbA1c levels, insulin dose, and body weight without hypoglycemia compared with insulin monotherapy. Combined treatment of canagliflozin, liraglutide, or exenatide with insulin was also effective in weight loss compared with insulin alone in these patients. Disclosure Y. Kim: None. S. Hwang: None. S. Lim: None.","heading_context":"Abstract","domain":"doi.org","title":"148-LB: Efficacy and Safety of Adding an Oral Hypoglycemic Agent or a GLP-1 Receptor Agonist to Insulin in Patients with Type 1 Diabetes: A Network Meta-analysis","url":"https://doi.org/10.2337/DB19-148-LB"},
{"id":"frag_dd1e8e98","text_content":"ObjectiveTo compare the safety and efficacy of the dipeptidylpeptidase-4 (DPP-4) inhibitors in patients with type 2 diabetes and inadequate glycemic control.DesignSystematic review of randomized controlled trials (RCTs), health economic evaluation studies, systematic reviews, and meta-analyses, followed by primary Bayesian mixed treatment comparison meta-analyses (MTCs), and secondary frequentist direct-comparison meta-analyses using a random-effects model. Outcomes were reported as weighted mean change from baseline, or odds ratio (OR) with 95% credible interval.Data sourcesMEDLINE, MEDLINE In-Process, EMBASE, and BIOSIS via Dialog ProQuest; Cochrane Central Register of Controlled Trials and Cochrane Database of Systematic Reviews via EBSCO; four diabetes and two technical congress abstracts; and health technology assessment organization websites.Eligibility criteriaPatients with type 2 diabetes and inadequate glycemic control receiving any pharmacological anti-diabetic treatment.Data extraction and analysisTitle/abstracts were reviewed for eligibility, followed by full-text review of publications remaining after first pass. A three-person team filtered articles and an independent reviewer checked a random selection (10%) of filtered articles. Data extraction and quality assessment of studies were also independently reviewed. Five DPP-4 inhibitors (alogliptin, linagliptin, saxagliptin, sitagliptin, and vildagliptin) were compared via meta-analysis (where data were available) as monotherapy, dual therapy (plus metformin, sulfonylurea, pioglitazone, or insulin), and triple therapy (plus metformin/sulfonylurea).ResultsThe review identified 6,601 articles; 163 met inclusion criteria and 85 publications from 83 RCTs contained sufficient or appropriate data for analysis. MTCs demonstrated no differences between DPP-4 inhibitors in mean change from baseline in glycosylated hemoglobin (HbA1c) or body weight, or the proportions of patients achieving HbA1c <7% or experiencing a hypoglycemic event, apart from in patients on alogliptin plus metformin, who achieved HbA1c <7% more frequently than those treated with saxagliptin plus metformin [OR 6.41 (95% CI 3.15–11.98) versus 2.17 (95% CI 1.56–2.95)].ConclusionsThis systematic review and MTC showed similar efficacy and safety for DPP-4 inhibitors as treatment for type 2 diabetes, either as monotherapy or combination therapy.","heading_context":"Abstract","domain":"link.springer.com","title":"Comparative Effectiveness of Dipeptidylpeptidase-4 Inhibitors in Type 2 Diabetes: A Systematic Review and Mixed Treatment Comparison","url":"https://link.springer.com/content/pdf/10.1007/s13300-014-0061-3.pdf"},
{"id":"frag_e3dbe05a","text_content":"Ramadan is the holy month for Muslims whereby they fast from predawn to after sunset and is observed by all healthy Muslim adults as well as a large population of type 2 diabetic Muslims.To determine the comparative effectiveness of various strategies that have been used for type 2 diabetic Muslim who fast during Ramadan.A systematic review and network meta-analysis of randomized controlled studies (RCT) as well as observational studies for patients with type 2 diabetes who fasted during Ramadan was conducted. Eight databases were searched from January 1980 through October 2015 for relevant studies. Two reviewers independently screened and assessed study for eligibility, assessed the risk of bias, and extracted relevant data. A network meta-analysis for each outcome was fitted separately, combining direct and indirect evidence for each comparison.Twenty-nine studies, 16 RCTs and 13 observational studies each met the inclusion criteria. The most common strategy used was drug changes during the Ramadan period, which found that the use of DPP-4 (Dipeptidyl peptidase inhibitor -4) inhibitors were associated with a reduction in incidence of experiencing hypoglycemia during Ramadan in both RCTs (pooled relative risk: 0.56; 95% confidence interval: 0.44-0.72) as well as in observational studies (pooled relative risk: 0.27; 0.09-0.75). Ramadan-focused education was shown to be beneficial in reducing hypoglycemia in observational studies but not RCTs (0.25 versus 1.00). Network meta-analyses suggest that incretin mimetics can reduce the risk of hypoglycemia by nearly 1.5 times.The newer antidiabetic agents appear to lower the risk of hypoglycemia and improved glycemic control when compared with sulfonylureas. Ramadan-focused education shows to be a promising strategy but more rigorous examination from RCTs are required.","heading_context":"Abstract","domain":"doi.org","title":"Strategies to Make Ramadan Fasting Safer in Type 2 Diabetics","url":"https://doi.org/10.1097/md.0000000000002457"},
{"id":"frag_ed467d04","text_content":"Abstract Concerns about the cardiovascular safety of dipeptidyl peptidase-4 (DPP-4) inhibitors persist. This study sought to determine whether there is a differential risk of hospitalization for cardiovascular diseases (CVDs) between DPP-4 inhibitors and glimepiride. We conducted this retrospective cohort study by using the Korean National Health Insurance Service database from December 1, 2008, to December 31, 2013. The study subjects were new users of DPP-4 inhibitors or glimepiride for type 2 diabetes. Outcome was defined as hospitalization for CVDs, including angina pectoris, myocardial infarction, transient cerebral ischemic attack, heart failure, or cerebrovascular disease or any procedure involving coronary artery bypass grafting or percutaneous coronary intervention. We used a Cox proportional hazard model to estimate the adjusted hazard ratios (aHRs) and their 95% confidence intervals (CIs), to assess the risk of CVDs associated with the use of DPP-4 inhibitors compared with glimepiride. The cohort consisted of 1,045,975 patients, with 6504 in the DPP-4 inhibitors group and 13,447 in the glimepiride group. No significant increased risk of total CVDs was found (aHR, 0.87; 95% CI, 0.75–1.01) in the DPP-4 inhibitors versus glimepiride group. A decreased risk of hospitalization for CVDs was found among patients with a history of visit for CVDs (aHR, 0.73; 95% CI, 0.56–0.97) or with >2.5 years’ duration of type 2 diabetes (aHR, 0.77; 95% CI, 0.66–0.91) in the DPP-4 inhibitors versus glimepiride group. DPP-4 inhibitors did not increase cardiovascular risk compared with glimepiride regardless of CVD history and diabetes duration.","heading_context":"Abstract","domain":"doi.org","title":"Comparative safety for cardiovascular outcomes of DPP-4 inhibitors versus glimepiride in patients with type 2 diabetes","url":"https://doi.org/10.1097/md.0000000000007213"},
{"id":"frag_f67dda1d","text_content":"Rationale Type 1 diabetes mellitus (T1DM) is characterized by autoimmune destruction of pancreatic β-cells, leading to insulin deficiency and hyperglycemia. Although insulin therapy remains the cornerstone of T1DM management, achieving optimal glycemic control remains challenging. Dipeptidyl peptidase-4 (DPP-4) inhibitors, approved for type 2 diabetes, enhance endogenous incretin action and may enhance β-cell function. Some clinical trials have explored their adjunctive use in T1DM. This systematic review and meta-analysis aimed to evaluate the efficacy and safety of DPP-4 inhibitors as an adjunct to insulin in patients with T1DM. Methods We systematically searched PubMed, Cochrane Library, Medline (OVID), Scopus, and ClinicalTrials.gov up to January 2025 for eligible studies. Randomized controlled trials (RCTs) investigating DPP-4 inhibitors versus placebo, both on top of insulin therapy for at least 12 weeks in T1DM patients, were included. The primary outcome was the change in HbA1c. Secondary outcomes included blood glucose, C-peptide, insulin dosage, BMI, weight, adverse events, and HOMA2-β scores. Risk of bias was assessed using the Cochrane RoB 2.0 tool. Data were pooled using a random-effects model, with effect sizes expressed as mean differences (MD) and 95% confidence intervals (CI). Results Out of 1,117 identified studies, seven RCTs comprising 333 participants (176 in the experimental group, 157 in the control group) were included. The addition of DPP-4 inhibitors did not result in a significant or sustained reduction in HbA1c overall, except for a transient improvement between 3 and 6 months (MD −0.10%, 95% CI −0.16 to −0.05, p = 0.0003). DPP-4 inhibitors significantly reduced daily insulin requirements, particularly bolus doses, and postprandial blood glucose (by −34.40 mg/dL), especially in patients with a BMI < 25 kg/m² and diabetes duration <3 years. No significant effects were observed on weight, BMI, fasting blood glucose, fasting or postprandial C-peptide beyond three months. HOMA2-β scores were significantly higher with DPP-4 inhibitors. Safety outcomes were comparable between groups. Conclusions DPP-4 inhibitors appear safe as adjunct therapy to insulin in patients with T1DM. Although they do not offer sustained HbA1c reduction, they may reduce daily insulin requirements, improve postprandial glucose, and transiently enhance β-cell function. Further large-scale studies are needed to better define the subgroups that might benefit from this strategy. Registration This study was registered in PROSPERO (CRD42024610965)","heading_context":"Abstract","domain":"doi.org","title":"The efficacy of DPP IV inhibitors as adjunct therapy for patients with auto-immune Diabetes: A systematic review and meta-analysis","url":"https://doi.org/10.1371/journal.pone.0332191"},
{"id":"frag_f846c0b3","text_content":"Introduction: There is always been a need for safe and effective adjuvant therapy in type 1 Diabetes not just for glycemic control but also for cardio-renal benefits. Objectives: To evaluatewhether addition of DPP-4 inhibitors reduces the ketogenic potential of SGLT2i when used as an adjuvant therapy in type 1 Diabetes. Materials and Methods: 20 type 1 Diabetes subjects above 18 years of age with poorly controlled glycemia (HbA1c 7 to 10%) were included in the study. At baseline along with physical examination, biochemical parameters- FPG, PPG, HBA1C, beta-hydroxybutyrate and fasting Glucagon were collected. This cohort was then treated with sitagliptin for 3 months, dapagliflozin for 3 months and combination of sitagliptin and dapagliflozin for 3-month adjuvant to insulin. At the end of each 3 months period anthropometric and biochemical parameters were assessed. Results and Observation: The plasma Glucagon levels compared with the baseline (30.99 pg/ml), did not change with sitagliptin (29.89 pg/ml), increased significantly with dapagliflozin (55.89 pg/mL) [+24.9 pg/mL (p < 0.05)] and the combination treatment failed to reduce the Glucagon level 49.37 pg/ml. The median ketone (beta-hydroxybutyrate) levels compared to the baseline [0.11 (0.04 -0.87)] were numerically lower with sitagliptin [0.06 (0.02 - 0.33)] and higher with dapagliflozin [0.14 (0.04 - 1.16)]. However, the combination treatment failed to reduce the ketone levels [0.17 (0.02 - 0.92)]. There was a statistically significant improvement in glycemic parameter, HbA1c with each of the intervention. On comparing with the baseline the mean difference of HbA1c after sitagliptin was 1.39%, after dapagliflozin was 1.08% and after the combination treatment was 1.59%. This was achieved with no change in the insulin dose. There was a reduction in weight, BMI, SBP and DBP with individual as well as combination treatment. Change in waist circumference was minimal. Conclusions: Sitagliptin and dapagliflozin either alone or in combination as adjuvant therapy in type 1 diabetes results in a significant improvement in glycaemia. Sitagliptin failed to reduce fasting plasma glucagon and blood ketone (beta-hydroxybutyrate) levels when added to dapagliflozin. It thus appears that the ketogenic potential of dapagliflozin cannot be brought down by addition of sitagliptin. Thus, DPP4 inhibitors and SGLT2 inhibitors can be a useful adjuvant in the therapy of type 1 DM, but SGLT2 inhibitors should be used only after understanding the potential risk for ketosis.","heading_context":"Abstract","domain":"doi.org","title":"Abstract 169: A study to evaluate clinical and metabolic profile in a type 1 diabetes cohort receiving Dpp-4 inhibitor plus Sglt2i compared to either drug alone as an adjuvant therapy","url":"https://doi.org/10.4103/2230-8210.363674"},
{"id":"frag_fc6269fc","text_content":"Abstract Peptide drug development has made great progress in the last decade thanks to new production, modification, and analytic technologies. Peptides have been produced and modified using both chemical and biological methods, together with novel design and delivery strategies, which have helped to overcome the inherent drawbacks of peptides and have allowed the continued advancement of this field. A wide variety of natural and modified peptides have been obtained and studied, covering multiple therapeutic areas. This review summarizes the efforts and achievements in peptide drug discovery, production, and modification, and their current applications. We also discuss the value and challenges associated with future developments in therapeutic peptides.","heading_context":"Abstract","domain":"www.nature.com","title":"Therapeutic peptides: current applications and future directions","url":"https://www.nature.com/articles/s41392-022-00904-4.pdf"}]
